node {
  name: "/_PyFunc"
  op: "_PyFunc"
  device {
    device_name: "CPU"
  }
  attr {
    key: "handle"
    value {
      i: 0
    }
  }
  attr {
    key: "input_type"
    value {
    }
  }
  attr {
    key: "output_type"
    value {
      type_list {
        type: kInt64
        type: kFloat
        type: kInt32
        type: kInt64
        type: kFloat
        type: kInt32
        type: kInt64
        type: kFloat
        type: kInt32
        type: kInt64
        type: kFloat
        type: kInt32
        type: kInt64
        type: kFloat
        type: kInt32
        type: kInt64
        type: kFloat
        type: kInt32
        type: kInt64
        type: kFloat
        type: kInt32
        type: kFloat
        type: kFloat
        type: kInt32
        type: kInt32
        type: kInt32
        type: kInt32
        type: kInt32
        type: kInt32
      }
    }
  }
}
node {
  name: "/PsIsInitializedOp"
  op: "PsIsInitializedOp"
  device {
    device_name: "CPU"
  }
  attr {
    key: "var_name"
    value {
      s: "uid_embedding"
    }
  }
}
node {
  name: "/PsRegisterVariableOp"
  op: "PsRegisterVariableOp"
  device {
    device_name: "CPU"
  }
  attr {
    key: "dtype"
    value {
      type: kFloat
    }
  }
  attr {
    key: "extra_info"
    value {
      s: "batch_read=3000;"
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim: 543060
        dim: 18
      }
    }
  }
  attr {
    key: "var_name"
    value {
      s: "uid_embedding"
    }
  }
  attr {
    key: "var_type"
    value {
      s: "index"
    }
  }
}
node {
  name: "/PsVarianceScalingInitializerOp"
  op: "PsVarianceScalingInitializerOp"
  device {
    device_name: "CPU"
  }
  attr {
    key: "distribution"
    value {
      s: "normal"
    }
  }
  attr {
    key: "mode"
    value {
      s: "fan_avg"
    }
  }
  attr {
    key: "scale"
    value {
      f: 1.0
    }
  }
  attr {
    key: "seed"
    value {
      i: 3
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim: 543060
        dim: 18
      }
    }
  }
  attr {
    key: "var_name"
    value {
      s: "uid_embedding"
    }
  }
  attr {
    key: "var_type"
    value {
      s: "index"
    }
  }
}
node {
  name: "/PsPullOp"
  op: "PsPullOp"
  device {
    device_name: "CPU"
  }
  attr {
    key: "dtype"
    value {
      type: kFloat
    }
  }
  attr {
    key: "var_name"
    value {
      s: "uid_embedding"
    }
  }
  attr {
    key: "var_type"
    value {
      s: "index"
    }
  }
}
node {
  name: "/Unique"
  op: "Unique"
  input: "/_PyFunc:0"
  device {
    device_name: "CPU"
  }
  attr {
    key: "dtype"
    value {
      type: kInt64
    }
  }
  attr {
    key: "itype"
    value {
      type: kInt32
    }
  }
}
node {
  name: "/PsSparsePullOp"
  op: "PsSparsePullOp"
  input: "/Unique:0"
  device {
    device_name: "CPU"
  }
  attr {
    key: "dtype"
    value {
      type: kInt64
    }
  }
  attr {
    key: "otype"
    value {
      type: kFloat
    }
  }
  attr {
    key: "save_ratio"
    value {
      f: 1.0
    }
  }
  attr {
    key: "var_name"
    value {
      s: "uid_embedding"
    }
  }
  attr {
    key: "var_type"
    value {
      s: "index"
    }
  }
}
node {
  name: "/_Constant"
  op: "_Constant"
  device {
    device_name: "CPU"
  }
  attr {
    key: "dtype"
    value {
      type: kInt32
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim: 0
      }
    }
  }
  attr {
    key: "value"
    value {
      s: ""
    }
  }
}
node {
  name: "/KSum"
  op: "KSum"
  input: "/PsSparsePullOp:0"
  input: "/Unique:1"
  input: "/_PyFunc:1"
  input: "/_PyFunc:2"
  input: "/_Constant:0"
  device {
    device_name: "CPU"
  }
  attr {
    key: "average"
    value {
      b: false
    }
  }
  attr {
    key: "dtype"
    value {
      type: kFloat
    }
  }
  attr {
    key: "itype"
    value {
      type: kInt32
    }
  }
}
node {
  name: "/PsIsInitializedOp_1"
  op: "PsIsInitializedOp"
  device {
    device_name: "CPU"
  }
  attr {
    key: "var_name"
    value {
      s: "mid_embedding"
    }
  }
}
node {
  name: "/PsRegisterVariableOp_1"
  op: "PsRegisterVariableOp"
  device {
    device_name: "CPU"
  }
  attr {
    key: "dtype"
    value {
      type: kFloat
    }
  }
  attr {
    key: "extra_info"
    value {
      s: "batch_read=3000;"
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim: 367983
        dim: 18
      }
    }
  }
  attr {
    key: "var_name"
    value {
      s: "mid_embedding"
    }
  }
  attr {
    key: "var_type"
    value {
      s: "index"
    }
  }
}
node {
  name: "/PsVarianceScalingInitializerOp_1"
  op: "PsVarianceScalingInitializerOp"
  device {
    device_name: "CPU"
  }
  attr {
    key: "distribution"
    value {
      s: "normal"
    }
  }
  attr {
    key: "mode"
    value {
      s: "fan_avg"
    }
  }
  attr {
    key: "scale"
    value {
      f: 1.0
    }
  }
  attr {
    key: "seed"
    value {
      i: 3
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim: 367983
        dim: 18
      }
    }
  }
  attr {
    key: "var_name"
    value {
      s: "mid_embedding"
    }
  }
  attr {
    key: "var_type"
    value {
      s: "index"
    }
  }
}
node {
  name: "/PsPullOp_1"
  op: "PsPullOp"
  device {
    device_name: "CPU"
  }
  attr {
    key: "dtype"
    value {
      type: kFloat
    }
  }
  attr {
    key: "var_name"
    value {
      s: "mid_embedding"
    }
  }
  attr {
    key: "var_type"
    value {
      s: "index"
    }
  }
}
node {
  name: "/Unique_1"
  op: "Unique"
  input: "/_PyFunc:3"
  device {
    device_name: "CPU"
  }
  attr {
    key: "dtype"
    value {
      type: kInt64
    }
  }
  attr {
    key: "itype"
    value {
      type: kInt32
    }
  }
}
node {
  name: "/PsSparsePullOp_1"
  op: "PsSparsePullOp"
  input: "/Unique_1:0"
  device {
    device_name: "CPU"
  }
  attr {
    key: "dtype"
    value {
      type: kInt64
    }
  }
  attr {
    key: "otype"
    value {
      type: kFloat
    }
  }
  attr {
    key: "save_ratio"
    value {
      f: 1.0
    }
  }
  attr {
    key: "var_name"
    value {
      s: "mid_embedding"
    }
  }
  attr {
    key: "var_type"
    value {
      s: "index"
    }
  }
}
node {
  name: "/_Constant_1"
  op: "_Constant"
  device {
    device_name: "CPU"
  }
  attr {
    key: "dtype"
    value {
      type: kInt32
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim: 0
      }
    }
  }
  attr {
    key: "value"
    value {
      s: ""
    }
  }
}
node {
  name: "/KSum_1"
  op: "KSum"
  input: "/PsSparsePullOp_1:0"
  input: "/Unique_1:1"
  input: "/_PyFunc:4"
  input: "/_PyFunc:5"
  input: "/_Constant_1:0"
  device {
    device_name: "CPU"
  }
  attr {
    key: "average"
    value {
      b: false
    }
  }
  attr {
    key: "dtype"
    value {
      type: kFloat
    }
  }
  attr {
    key: "itype"
    value {
      type: kInt32
    }
  }
}
node {
  name: "/PsIsInitializedOp_2"
  op: "PsIsInitializedOp"
  device {
    device_name: "CPU"
  }
  attr {
    key: "var_name"
    value {
      s: "cat_embedding"
    }
  }
}
node {
  name: "/PsRegisterVariableOp_2"
  op: "PsRegisterVariableOp"
  device {
    device_name: "CPU"
  }
  attr {
    key: "dtype"
    value {
      type: kFloat
    }
  }
  attr {
    key: "extra_info"
    value {
      s: "batch_read=3000;"
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim: 1601
        dim: 18
      }
    }
  }
  attr {
    key: "var_name"
    value {
      s: "cat_embedding"
    }
  }
  attr {
    key: "var_type"
    value {
      s: "index"
    }
  }
}
node {
  name: "/PsVarianceScalingInitializerOp_2"
  op: "PsVarianceScalingInitializerOp"
  device {
    device_name: "CPU"
  }
  attr {
    key: "distribution"
    value {
      s: "normal"
    }
  }
  attr {
    key: "mode"
    value {
      s: "fan_avg"
    }
  }
  attr {
    key: "scale"
    value {
      f: 1.0
    }
  }
  attr {
    key: "seed"
    value {
      i: 3
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim: 1601
        dim: 18
      }
    }
  }
  attr {
    key: "var_name"
    value {
      s: "cat_embedding"
    }
  }
  attr {
    key: "var_type"
    value {
      s: "index"
    }
  }
}
node {
  name: "/PsPullOp_2"
  op: "PsPullOp"
  device {
    device_name: "CPU"
  }
  attr {
    key: "dtype"
    value {
      type: kFloat
    }
  }
  attr {
    key: "var_name"
    value {
      s: "cat_embedding"
    }
  }
  attr {
    key: "var_type"
    value {
      s: "index"
    }
  }
}
node {
  name: "/Unique_2"
  op: "Unique"
  input: "/_PyFunc:6"
  device {
    device_name: "CPU"
  }
  attr {
    key: "dtype"
    value {
      type: kInt64
    }
  }
  attr {
    key: "itype"
    value {
      type: kInt32
    }
  }
}
node {
  name: "/PsSparsePullOp_2"
  op: "PsSparsePullOp"
  input: "/Unique_2:0"
  device {
    device_name: "CPU"
  }
  attr {
    key: "dtype"
    value {
      type: kInt64
    }
  }
  attr {
    key: "otype"
    value {
      type: kFloat
    }
  }
  attr {
    key: "save_ratio"
    value {
      f: 1.0
    }
  }
  attr {
    key: "var_name"
    value {
      s: "cat_embedding"
    }
  }
  attr {
    key: "var_type"
    value {
      s: "index"
    }
  }
}
node {
  name: "/_Constant_2"
  op: "_Constant"
  device {
    device_name: "CPU"
  }
  attr {
    key: "dtype"
    value {
      type: kInt32
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim: 0
      }
    }
  }
  attr {
    key: "value"
    value {
      s: ""
    }
  }
}
node {
  name: "/KSum_2"
  op: "KSum"
  input: "/PsSparsePullOp_2:0"
  input: "/Unique_2:1"
  input: "/_PyFunc:7"
  input: "/_PyFunc:8"
  input: "/_Constant_2:0"
  device {
    device_name: "CPU"
  }
  attr {
    key: "average"
    value {
      b: false
    }
  }
  attr {
    key: "dtype"
    value {
      type: kFloat
    }
  }
  attr {
    key: "itype"
    value {
      type: kInt32
    }
  }
}
node {
  name: "/PsIsInitializedOp_3"
  op: "PsIsInitializedOp"
  device {
    device_name: "CPU"
  }
  attr {
    key: "var_name"
    value {
      s: "mid_embedding"
    }
  }
}
node {
  name: "/PsRegisterVariableOp_3"
  op: "PsRegisterVariableOp"
  device {
    device_name: "CPU"
  }
  attr {
    key: "dtype"
    value {
      type: kFloat
    }
  }
  attr {
    key: "extra_info"
    value {
      s: "batch_read=3000;"
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim: 367983
        dim: 18
      }
    }
  }
  attr {
    key: "var_name"
    value {
      s: "mid_embedding"
    }
  }
  attr {
    key: "var_type"
    value {
      s: "index"
    }
  }
}
node {
  name: "/PsVarianceScalingInitializerOp_3"
  op: "PsVarianceScalingInitializerOp"
  device {
    device_name: "CPU"
  }
  attr {
    key: "distribution"
    value {
      s: "normal"
    }
  }
  attr {
    key: "mode"
    value {
      s: "fan_avg"
    }
  }
  attr {
    key: "scale"
    value {
      f: 1.0
    }
  }
  attr {
    key: "seed"
    value {
      i: 3
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim: 367983
        dim: 18
      }
    }
  }
  attr {
    key: "var_name"
    value {
      s: "mid_embedding"
    }
  }
  attr {
    key: "var_type"
    value {
      s: "index"
    }
  }
}
node {
  name: "/PsPullOp_3"
  op: "PsPullOp"
  device {
    device_name: "CPU"
  }
  attr {
    key: "dtype"
    value {
      type: kFloat
    }
  }
  attr {
    key: "var_name"
    value {
      s: "mid_embedding"
    }
  }
  attr {
    key: "var_type"
    value {
      s: "index"
    }
  }
}
node {
  name: "/Unique_3"
  op: "Unique"
  input: "/_PyFunc:9"
  device {
    device_name: "CPU"
  }
  attr {
    key: "dtype"
    value {
      type: kInt64
    }
  }
  attr {
    key: "itype"
    value {
      type: kInt32
    }
  }
}
node {
  name: "/PsSparsePullOp_3"
  op: "PsSparsePullOp"
  input: "/Unique_3:0"
  device {
    device_name: "CPU"
  }
  attr {
    key: "dtype"
    value {
      type: kInt64
    }
  }
  attr {
    key: "otype"
    value {
      type: kFloat
    }
  }
  attr {
    key: "save_ratio"
    value {
      f: 1.0
    }
  }
  attr {
    key: "var_name"
    value {
      s: "mid_embedding"
    }
  }
  attr {
    key: "var_type"
    value {
      s: "index"
    }
  }
}
node {
  name: "/_Constant_3"
  op: "_Constant"
  device {
    device_name: "CPU"
  }
  attr {
    key: "dtype"
    value {
      type: kInt32
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim: 0
      }
    }
  }
  attr {
    key: "value"
    value {
      s: ""
    }
  }
}
node {
  name: "/KSum_3"
  op: "KSum"
  input: "/PsSparsePullOp_3:0"
  input: "/Unique_3:1"
  input: "/_PyFunc:10"
  input: "/_PyFunc:11"
  input: "/_Constant_3:0"
  device {
    device_name: "CPU"
  }
  attr {
    key: "average"
    value {
      b: false
    }
  }
  attr {
    key: "dtype"
    value {
      type: kFloat
    }
  }
  attr {
    key: "itype"
    value {
      type: kInt32
    }
  }
}
node {
  name: "/PsIsInitializedOp_4"
  op: "PsIsInitializedOp"
  device {
    device_name: "CPU"
  }
  attr {
    key: "var_name"
    value {
      s: "cat_embedding"
    }
  }
}
node {
  name: "/PsRegisterVariableOp_4"
  op: "PsRegisterVariableOp"
  device {
    device_name: "CPU"
  }
  attr {
    key: "dtype"
    value {
      type: kFloat
    }
  }
  attr {
    key: "extra_info"
    value {
      s: "batch_read=3000;"
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim: 1601
        dim: 18
      }
    }
  }
  attr {
    key: "var_name"
    value {
      s: "cat_embedding"
    }
  }
  attr {
    key: "var_type"
    value {
      s: "index"
    }
  }
}
node {
  name: "/PsVarianceScalingInitializerOp_4"
  op: "PsVarianceScalingInitializerOp"
  device {
    device_name: "CPU"
  }
  attr {
    key: "distribution"
    value {
      s: "normal"
    }
  }
  attr {
    key: "mode"
    value {
      s: "fan_avg"
    }
  }
  attr {
    key: "scale"
    value {
      f: 1.0
    }
  }
  attr {
    key: "seed"
    value {
      i: 3
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim: 1601
        dim: 18
      }
    }
  }
  attr {
    key: "var_name"
    value {
      s: "cat_embedding"
    }
  }
  attr {
    key: "var_type"
    value {
      s: "index"
    }
  }
}
node {
  name: "/PsPullOp_4"
  op: "PsPullOp"
  device {
    device_name: "CPU"
  }
  attr {
    key: "dtype"
    value {
      type: kFloat
    }
  }
  attr {
    key: "var_name"
    value {
      s: "cat_embedding"
    }
  }
  attr {
    key: "var_type"
    value {
      s: "index"
    }
  }
}
node {
  name: "/Unique_4"
  op: "Unique"
  input: "/_PyFunc:12"
  device {
    device_name: "CPU"
  }
  attr {
    key: "dtype"
    value {
      type: kInt64
    }
  }
  attr {
    key: "itype"
    value {
      type: kInt32
    }
  }
}
node {
  name: "/PsSparsePullOp_4"
  op: "PsSparsePullOp"
  input: "/Unique_4:0"
  device {
    device_name: "CPU"
  }
  attr {
    key: "dtype"
    value {
      type: kInt64
    }
  }
  attr {
    key: "otype"
    value {
      type: kFloat
    }
  }
  attr {
    key: "save_ratio"
    value {
      f: 1.0
    }
  }
  attr {
    key: "var_name"
    value {
      s: "cat_embedding"
    }
  }
  attr {
    key: "var_type"
    value {
      s: "index"
    }
  }
}
node {
  name: "/_Constant_4"
  op: "_Constant"
  device {
    device_name: "CPU"
  }
  attr {
    key: "dtype"
    value {
      type: kInt32
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim: 0
      }
    }
  }
  attr {
    key: "value"
    value {
      s: ""
    }
  }
}
node {
  name: "/KSum_4"
  op: "KSum"
  input: "/PsSparsePullOp_4:0"
  input: "/Unique_4:1"
  input: "/_PyFunc:13"
  input: "/_PyFunc:14"
  input: "/_Constant_4:0"
  device {
    device_name: "CPU"
  }
  attr {
    key: "average"
    value {
      b: false
    }
  }
  attr {
    key: "dtype"
    value {
      type: kFloat
    }
  }
  attr {
    key: "itype"
    value {
      type: kInt32
    }
  }
}
node {
  name: "/PsIsInitializedOp_5"
  op: "PsIsInitializedOp"
  device {
    device_name: "CPU"
  }
  attr {
    key: "var_name"
    value {
      s: "mid_embedding"
    }
  }
}
node {
  name: "/PsRegisterVariableOp_5"
  op: "PsRegisterVariableOp"
  device {
    device_name: "CPU"
  }
  attr {
    key: "dtype"
    value {
      type: kFloat
    }
  }
  attr {
    key: "extra_info"
    value {
      s: "batch_read=3000;"
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim: 367983
        dim: 18
      }
    }
  }
  attr {
    key: "var_name"
    value {
      s: "mid_embedding"
    }
  }
  attr {
    key: "var_type"
    value {
      s: "index"
    }
  }
}
node {
  name: "/PsVarianceScalingInitializerOp_5"
  op: "PsVarianceScalingInitializerOp"
  device {
    device_name: "CPU"
  }
  attr {
    key: "distribution"
    value {
      s: "normal"
    }
  }
  attr {
    key: "mode"
    value {
      s: "fan_avg"
    }
  }
  attr {
    key: "scale"
    value {
      f: 1.0
    }
  }
  attr {
    key: "seed"
    value {
      i: 3
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim: 367983
        dim: 18
      }
    }
  }
  attr {
    key: "var_name"
    value {
      s: "mid_embedding"
    }
  }
  attr {
    key: "var_type"
    value {
      s: "index"
    }
  }
}
node {
  name: "/PsPullOp_5"
  op: "PsPullOp"
  device {
    device_name: "CPU"
  }
  attr {
    key: "dtype"
    value {
      type: kFloat
    }
  }
  attr {
    key: "var_name"
    value {
      s: "mid_embedding"
    }
  }
  attr {
    key: "var_type"
    value {
      s: "index"
    }
  }
}
node {
  name: "/Unique_5"
  op: "Unique"
  input: "/_PyFunc:15"
  device {
    device_name: "CPU"
  }
  attr {
    key: "dtype"
    value {
      type: kInt64
    }
  }
  attr {
    key: "itype"
    value {
      type: kInt32
    }
  }
}
node {
  name: "/PsSparsePullOp_5"
  op: "PsSparsePullOp"
  input: "/Unique_5:0"
  device {
    device_name: "CPU"
  }
  attr {
    key: "dtype"
    value {
      type: kInt64
    }
  }
  attr {
    key: "otype"
    value {
      type: kFloat
    }
  }
  attr {
    key: "save_ratio"
    value {
      f: 1.0
    }
  }
  attr {
    key: "var_name"
    value {
      s: "mid_embedding"
    }
  }
  attr {
    key: "var_type"
    value {
      s: "index"
    }
  }
}
node {
  name: "/_Constant_5"
  op: "_Constant"
  device {
    device_name: "CPU"
  }
  attr {
    key: "dtype"
    value {
      type: kInt32
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim: 0
      }
    }
  }
  attr {
    key: "value"
    value {
      s: ""
    }
  }
}
node {
  name: "/KSum_5"
  op: "KSum"
  input: "/PsSparsePullOp_5:0"
  input: "/Unique_5:1"
  input: "/_PyFunc:16"
  input: "/_PyFunc:17"
  input: "/_Constant_5:0"
  device {
    device_name: "CPU"
  }
  attr {
    key: "average"
    value {
      b: false
    }
  }
  attr {
    key: "dtype"
    value {
      type: kFloat
    }
  }
  attr {
    key: "itype"
    value {
      type: kInt32
    }
  }
}
node {
  name: "/PsIsInitializedOp_6"
  op: "PsIsInitializedOp"
  device {
    device_name: "CPU"
  }
  attr {
    key: "var_name"
    value {
      s: "cat_embedding"
    }
  }
}
node {
  name: "/PsRegisterVariableOp_6"
  op: "PsRegisterVariableOp"
  device {
    device_name: "CPU"
  }
  attr {
    key: "dtype"
    value {
      type: kFloat
    }
  }
  attr {
    key: "extra_info"
    value {
      s: "batch_read=3000;"
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim: 1601
        dim: 18
      }
    }
  }
  attr {
    key: "var_name"
    value {
      s: "cat_embedding"
    }
  }
  attr {
    key: "var_type"
    value {
      s: "index"
    }
  }
}
node {
  name: "/PsVarianceScalingInitializerOp_6"
  op: "PsVarianceScalingInitializerOp"
  device {
    device_name: "CPU"
  }
  attr {
    key: "distribution"
    value {
      s: "normal"
    }
  }
  attr {
    key: "mode"
    value {
      s: "fan_avg"
    }
  }
  attr {
    key: "scale"
    value {
      f: 1.0
    }
  }
  attr {
    key: "seed"
    value {
      i: 3
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim: 1601
        dim: 18
      }
    }
  }
  attr {
    key: "var_name"
    value {
      s: "cat_embedding"
    }
  }
  attr {
    key: "var_type"
    value {
      s: "index"
    }
  }
}
node {
  name: "/PsPullOp_6"
  op: "PsPullOp"
  device {
    device_name: "CPU"
  }
  attr {
    key: "dtype"
    value {
      type: kFloat
    }
  }
  attr {
    key: "var_name"
    value {
      s: "cat_embedding"
    }
  }
  attr {
    key: "var_type"
    value {
      s: "index"
    }
  }
}
node {
  name: "/Unique_6"
  op: "Unique"
  input: "/_PyFunc:18"
  device {
    device_name: "CPU"
  }
  attr {
    key: "dtype"
    value {
      type: kInt64
    }
  }
  attr {
    key: "itype"
    value {
      type: kInt32
    }
  }
}
node {
  name: "/PsSparsePullOp_6"
  op: "PsSparsePullOp"
  input: "/Unique_6:0"
  device {
    device_name: "CPU"
  }
  attr {
    key: "dtype"
    value {
      type: kInt64
    }
  }
  attr {
    key: "otype"
    value {
      type: kFloat
    }
  }
  attr {
    key: "save_ratio"
    value {
      f: 1.0
    }
  }
  attr {
    key: "var_name"
    value {
      s: "cat_embedding"
    }
  }
  attr {
    key: "var_type"
    value {
      s: "index"
    }
  }
}
node {
  name: "/_Constant_6"
  op: "_Constant"
  device {
    device_name: "CPU"
  }
  attr {
    key: "dtype"
    value {
      type: kInt32
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim: 0
      }
    }
  }
  attr {
    key: "value"
    value {
      s: ""
    }
  }
}
node {
  name: "/KSum_6"
  op: "KSum"
  input: "/PsSparsePullOp_6:0"
  input: "/Unique_6:1"
  input: "/_PyFunc:19"
  input: "/_PyFunc:20"
  input: "/_Constant_6:0"
  device {
    device_name: "CPU"
  }
  attr {
    key: "average"
    value {
      b: false
    }
  }
  attr {
    key: "dtype"
    value {
      type: kFloat
    }
  }
  attr {
    key: "itype"
    value {
      type: kInt32
    }
  }
}
node {
  name: "/PsIsInitializedOp_7"
  op: "PsIsInitializedOp"
  device {
    device_name: "CPU"
  }
  attr {
    key: "var_name"
    value {
      s: "tf_model/f1_attnull/kernel"
    }
  }
}
node {
  name: "/PsRegisterVariableOp_7"
  op: "PsRegisterVariableOp"
  device {
    device_name: "CPU"
  }
  attr {
    key: "dtype"
    value {
      type: kFloat
    }
  }
  attr {
    key: "extra_info"
    value {
      s: ""
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim: 144
        dim: 80
      }
    }
  }
  attr {
    key: "var_name"
    value {
      s: "tf_model/f1_attnull/kernel"
    }
  }
  attr {
    key: "var_type"
    value {
      s: "index"
    }
  }
}
node {
  name: "/PsVarianceScalingInitializerOp_7"
  op: "PsVarianceScalingInitializerOp"
  device {
    device_name: "CPU"
  }
  attr {
    key: "distribution"
    value {
      s: "normal"
    }
  }
  attr {
    key: "mode"
    value {
      s: "fan_avg"
    }
  }
  attr {
    key: "scale"
    value {
      f: 1.0
    }
  }
  attr {
    key: "seed"
    value {
      i: 100
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim: 144
        dim: 80
      }
    }
  }
  attr {
    key: "var_name"
    value {
      s: "tf_model/f1_attnull/kernel"
    }
  }
  attr {
    key: "var_type"
    value {
      s: "index"
    }
  }
}
node {
  name: "/PsPullOp_7"
  op: "PsPullOp"
  device {
    device_name: "CPU"
  }
  attr {
    key: "dtype"
    value {
      type: kFloat
    }
  }
  attr {
    key: "var_name"
    value {
      s: "tf_model/f1_attnull/kernel"
    }
  }
  attr {
    key: "var_type"
    value {
      s: "index"
    }
  }
}
node {
  name: "/PsIsInitializedOp_8"
  op: "PsIsInitializedOp"
  device {
    device_name: "CPU"
  }
  attr {
    key: "var_name"
    value {
      s: "tf_model/f1_attnull/bias"
    }
  }
}
node {
  name: "/PsRegisterVariableOp_8"
  op: "PsRegisterVariableOp"
  device {
    device_name: "CPU"
  }
  attr {
    key: "dtype"
    value {
      type: kFloat
    }
  }
  attr {
    key: "extra_info"
    value {
      s: ""
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim: 80
      }
    }
  }
  attr {
    key: "var_name"
    value {
      s: "tf_model/f1_attnull/bias"
    }
  }
  attr {
    key: "var_type"
    value {
      s: "index"
    }
  }
}
node {
  name: "/PsConstantInitializerOp"
  op: "PsConstantInitializerOp"
  device {
    device_name: "CPU"
  }
  attr {
    key: "value"
    value {
      f: 0.0
    }
  }
  attr {
    key: "var_name"
    value {
      s: "tf_model/f1_attnull/bias"
    }
  }
  attr {
    key: "var_type"
    value {
      s: "index"
    }
  }
}
node {
  name: "/PsPullOp_8"
  op: "PsPullOp"
  device {
    device_name: "CPU"
  }
  attr {
    key: "dtype"
    value {
      type: kFloat
    }
  }
  attr {
    key: "var_name"
    value {
      s: "tf_model/f1_attnull/bias"
    }
  }
  attr {
    key: "var_type"
    value {
      s: "index"
    }
  }
}
node {
  name: "/PsIsInitializedOp_9"
  op: "PsIsInitializedOp"
  device {
    device_name: "CPU"
  }
  attr {
    key: "var_name"
    value {
      s: "tf_model/f2_attnull/kernel"
    }
  }
}
node {
  name: "/PsRegisterVariableOp_9"
  op: "PsRegisterVariableOp"
  device {
    device_name: "CPU"
  }
  attr {
    key: "dtype"
    value {
      type: kFloat
    }
  }
  attr {
    key: "extra_info"
    value {
      s: ""
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim: 80
        dim: 40
      }
    }
  }
  attr {
    key: "var_name"
    value {
      s: "tf_model/f2_attnull/kernel"
    }
  }
  attr {
    key: "var_type"
    value {
      s: "index"
    }
  }
}
node {
  name: "/PsVarianceScalingInitializerOp_8"
  op: "PsVarianceScalingInitializerOp"
  device {
    device_name: "CPU"
  }
  attr {
    key: "distribution"
    value {
      s: "normal"
    }
  }
  attr {
    key: "mode"
    value {
      s: "fan_avg"
    }
  }
  attr {
    key: "scale"
    value {
      f: 1.0
    }
  }
  attr {
    key: "seed"
    value {
      i: 100
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim: 80
        dim: 40
      }
    }
  }
  attr {
    key: "var_name"
    value {
      s: "tf_model/f2_attnull/kernel"
    }
  }
  attr {
    key: "var_type"
    value {
      s: "index"
    }
  }
}
node {
  name: "/PsPullOp_9"
  op: "PsPullOp"
  device {
    device_name: "CPU"
  }
  attr {
    key: "dtype"
    value {
      type: kFloat
    }
  }
  attr {
    key: "var_name"
    value {
      s: "tf_model/f2_attnull/kernel"
    }
  }
  attr {
    key: "var_type"
    value {
      s: "index"
    }
  }
}
node {
  name: "/PsIsInitializedOp_10"
  op: "PsIsInitializedOp"
  device {
    device_name: "CPU"
  }
  attr {
    key: "var_name"
    value {
      s: "tf_model/f2_attnull/bias"
    }
  }
}
node {
  name: "/PsRegisterVariableOp_10"
  op: "PsRegisterVariableOp"
  device {
    device_name: "CPU"
  }
  attr {
    key: "dtype"
    value {
      type: kFloat
    }
  }
  attr {
    key: "extra_info"
    value {
      s: ""
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim: 40
      }
    }
  }
  attr {
    key: "var_name"
    value {
      s: "tf_model/f2_attnull/bias"
    }
  }
  attr {
    key: "var_type"
    value {
      s: "index"
    }
  }
}
node {
  name: "/PsConstantInitializerOp_1"
  op: "PsConstantInitializerOp"
  device {
    device_name: "CPU"
  }
  attr {
    key: "value"
    value {
      f: 0.0
    }
  }
  attr {
    key: "var_name"
    value {
      s: "tf_model/f2_attnull/bias"
    }
  }
  attr {
    key: "var_type"
    value {
      s: "index"
    }
  }
}
node {
  name: "/PsPullOp_10"
  op: "PsPullOp"
  device {
    device_name: "CPU"
  }
  attr {
    key: "dtype"
    value {
      type: kFloat
    }
  }
  attr {
    key: "var_name"
    value {
      s: "tf_model/f2_attnull/bias"
    }
  }
  attr {
    key: "var_type"
    value {
      s: "index"
    }
  }
}
node {
  name: "/PsIsInitializedOp_11"
  op: "PsIsInitializedOp"
  device {
    device_name: "CPU"
  }
  attr {
    key: "var_name"
    value {
      s: "tf_model/f3_attnull/kernel"
    }
  }
}
node {
  name: "/PsRegisterVariableOp_11"
  op: "PsRegisterVariableOp"
  device {
    device_name: "CPU"
  }
  attr {
    key: "dtype"
    value {
      type: kFloat
    }
  }
  attr {
    key: "extra_info"
    value {
      s: ""
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim: 40
        dim: 1
      }
    }
  }
  attr {
    key: "var_name"
    value {
      s: "tf_model/f3_attnull/kernel"
    }
  }
  attr {
    key: "var_type"
    value {
      s: "index"
    }
  }
}
node {
  name: "/PsVarianceScalingInitializerOp_9"
  op: "PsVarianceScalingInitializerOp"
  device {
    device_name: "CPU"
  }
  attr {
    key: "distribution"
    value {
      s: "normal"
    }
  }
  attr {
    key: "mode"
    value {
      s: "fan_avg"
    }
  }
  attr {
    key: "scale"
    value {
      f: 1.0
    }
  }
  attr {
    key: "seed"
    value {
      i: 100
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim: 40
        dim: 1
      }
    }
  }
  attr {
    key: "var_name"
    value {
      s: "tf_model/f3_attnull/kernel"
    }
  }
  attr {
    key: "var_type"
    value {
      s: "index"
    }
  }
}
node {
  name: "/PsPullOp_11"
  op: "PsPullOp"
  device {
    device_name: "CPU"
  }
  attr {
    key: "dtype"
    value {
      type: kFloat
    }
  }
  attr {
    key: "var_name"
    value {
      s: "tf_model/f3_attnull/kernel"
    }
  }
  attr {
    key: "var_type"
    value {
      s: "index"
    }
  }
}
node {
  name: "/PsIsInitializedOp_12"
  op: "PsIsInitializedOp"
  device {
    device_name: "CPU"
  }
  attr {
    key: "var_name"
    value {
      s: "tf_model/f3_attnull/bias"
    }
  }
}
node {
  name: "/PsRegisterVariableOp_12"
  op: "PsRegisterVariableOp"
  device {
    device_name: "CPU"
  }
  attr {
    key: "dtype"
    value {
      type: kFloat
    }
  }
  attr {
    key: "extra_info"
    value {
      s: ""
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim: 1
      }
    }
  }
  attr {
    key: "var_name"
    value {
      s: "tf_model/f3_attnull/bias"
    }
  }
  attr {
    key: "var_type"
    value {
      s: "index"
    }
  }
}
node {
  name: "/PsConstantInitializerOp_2"
  op: "PsConstantInitializerOp"
  device {
    device_name: "CPU"
  }
  attr {
    key: "value"
    value {
      f: 0.0
    }
  }
  attr {
    key: "var_name"
    value {
      s: "tf_model/f3_attnull/bias"
    }
  }
  attr {
    key: "var_type"
    value {
      s: "index"
    }
  }
}
node {
  name: "/PsPullOp_12"
  op: "PsPullOp"
  device {
    device_name: "CPU"
  }
  attr {
    key: "dtype"
    value {
      type: kFloat
    }
  }
  attr {
    key: "var_name"
    value {
      s: "tf_model/f3_attnull/bias"
    }
  }
  attr {
    key: "var_type"
    value {
      s: "index"
    }
  }
}
node {
  name: "/PsIsInitializedOp_13"
  op: "PsIsInitializedOp"
  device {
    device_name: "CPU"
  }
  attr {
    key: "var_name"
    value {
      s: "tf_model/bn1/gamma"
    }
  }
}
node {
  name: "/PsRegisterVariableOp_13"
  op: "PsRegisterVariableOp"
  device {
    device_name: "CPU"
  }
  attr {
    key: "dtype"
    value {
      type: kFloat
    }
  }
  attr {
    key: "extra_info"
    value {
      s: ""
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim: 162
      }
    }
  }
  attr {
    key: "var_name"
    value {
      s: "tf_model/bn1/gamma"
    }
  }
  attr {
    key: "var_type"
    value {
      s: "index"
    }
  }
}
node {
  name: "/PsConstantInitializerOp_3"
  op: "PsConstantInitializerOp"
  device {
    device_name: "CPU"
  }
  attr {
    key: "value"
    value {
      f: 1.0
    }
  }
  attr {
    key: "var_name"
    value {
      s: "tf_model/bn1/gamma"
    }
  }
  attr {
    key: "var_type"
    value {
      s: "index"
    }
  }
}
node {
  name: "/PsPullOp_13"
  op: "PsPullOp"
  device {
    device_name: "CPU"
  }
  attr {
    key: "dtype"
    value {
      type: kFloat
    }
  }
  attr {
    key: "var_name"
    value {
      s: "tf_model/bn1/gamma"
    }
  }
  attr {
    key: "var_type"
    value {
      s: "index"
    }
  }
}
node {
  name: "/PsIsInitializedOp_14"
  op: "PsIsInitializedOp"
  device {
    device_name: "CPU"
  }
  attr {
    key: "var_name"
    value {
      s: "tf_model/bn1/beta"
    }
  }
}
node {
  name: "/PsRegisterVariableOp_14"
  op: "PsRegisterVariableOp"
  device {
    device_name: "CPU"
  }
  attr {
    key: "dtype"
    value {
      type: kFloat
    }
  }
  attr {
    key: "extra_info"
    value {
      s: ""
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim: 162
      }
    }
  }
  attr {
    key: "var_name"
    value {
      s: "tf_model/bn1/beta"
    }
  }
  attr {
    key: "var_type"
    value {
      s: "index"
    }
  }
}
node {
  name: "/PsConstantInitializerOp_4"
  op: "PsConstantInitializerOp"
  device {
    device_name: "CPU"
  }
  attr {
    key: "value"
    value {
      f: 0.0
    }
  }
  attr {
    key: "var_name"
    value {
      s: "tf_model/bn1/beta"
    }
  }
  attr {
    key: "var_type"
    value {
      s: "index"
    }
  }
}
node {
  name: "/PsPullOp_14"
  op: "PsPullOp"
  device {
    device_name: "CPU"
  }
  attr {
    key: "dtype"
    value {
      type: kFloat
    }
  }
  attr {
    key: "var_name"
    value {
      s: "tf_model/bn1/beta"
    }
  }
  attr {
    key: "var_type"
    value {
      s: "index"
    }
  }
}
node {
  name: "/PsIsInitializedOp_15"
  op: "PsIsInitializedOp"
  device {
    device_name: "CPU"
  }
  attr {
    key: "var_name"
    value {
      s: "tf_model/bn1/moving_mean"
    }
  }
}
node {
  name: "/PsRegisterVariableOp_15"
  op: "PsRegisterVariableOp"
  device {
    device_name: "CPU"
  }
  attr {
    key: "dtype"
    value {
      type: kFloat
    }
  }
  attr {
    key: "extra_info"
    value {
      s: ""
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim: 162
      }
    }
  }
  attr {
    key: "var_name"
    value {
      s: "tf_model/bn1/moving_mean"
    }
  }
  attr {
    key: "var_type"
    value {
      s: "index"
    }
  }
}
node {
  name: "/PsConstantInitializerOp_5"
  op: "PsConstantInitializerOp"
  device {
    device_name: "CPU"
  }
  attr {
    key: "value"
    value {
      f: 0.0
    }
  }
  attr {
    key: "var_name"
    value {
      s: "tf_model/bn1/moving_mean"
    }
  }
  attr {
    key: "var_type"
    value {
      s: "index"
    }
  }
}
node {
  name: "/PsPullOp_15"
  op: "PsPullOp"
  device {
    device_name: "CPU"
  }
  attr {
    key: "dtype"
    value {
      type: kFloat
    }
  }
  attr {
    key: "var_name"
    value {
      s: "tf_model/bn1/moving_mean"
    }
  }
  attr {
    key: "var_type"
    value {
      s: "index"
    }
  }
}
node {
  name: "/PsIsInitializedOp_16"
  op: "PsIsInitializedOp"
  device {
    device_name: "CPU"
  }
  attr {
    key: "var_name"
    value {
      s: "tf_model/bn1/moving_variance"
    }
  }
}
node {
  name: "/PsRegisterVariableOp_16"
  op: "PsRegisterVariableOp"
  device {
    device_name: "CPU"
  }
  attr {
    key: "dtype"
    value {
      type: kFloat
    }
  }
  attr {
    key: "extra_info"
    value {
      s: ""
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim: 162
      }
    }
  }
  attr {
    key: "var_name"
    value {
      s: "tf_model/bn1/moving_variance"
    }
  }
  attr {
    key: "var_type"
    value {
      s: "index"
    }
  }
}
node {
  name: "/PsConstantInitializerOp_6"
  op: "PsConstantInitializerOp"
  device {
    device_name: "CPU"
  }
  attr {
    key: "value"
    value {
      f: 1.0
    }
  }
  attr {
    key: "var_name"
    value {
      s: "tf_model/bn1/moving_variance"
    }
  }
  attr {
    key: "var_type"
    value {
      s: "index"
    }
  }
}
node {
  name: "/PsPullOp_16"
  op: "PsPullOp"
  device {
    device_name: "CPU"
  }
  attr {
    key: "dtype"
    value {
      type: kFloat
    }
  }
  attr {
    key: "var_name"
    value {
      s: "tf_model/bn1/moving_variance"
    }
  }
  attr {
    key: "var_type"
    value {
      s: "index"
    }
  }
}
node {
  name: "/PsIsInitializedOp_17"
  op: "PsIsInitializedOp"
  device {
    device_name: "CPU"
  }
  attr {
    key: "var_name"
    value {
      s: "tf_model/f1/kernel"
    }
  }
}
node {
  name: "/PsRegisterVariableOp_17"
  op: "PsRegisterVariableOp"
  device {
    device_name: "CPU"
  }
  attr {
    key: "dtype"
    value {
      type: kFloat
    }
  }
  attr {
    key: "extra_info"
    value {
      s: ""
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim: 162
        dim: 200
      }
    }
  }
  attr {
    key: "var_name"
    value {
      s: "tf_model/f1/kernel"
    }
  }
  attr {
    key: "var_type"
    value {
      s: "index"
    }
  }
}
node {
  name: "/PsVarianceScalingInitializerOp_10"
  op: "PsVarianceScalingInitializerOp"
  device {
    device_name: "CPU"
  }
  attr {
    key: "distribution"
    value {
      s: "normal"
    }
  }
  attr {
    key: "mode"
    value {
      s: "fan_avg"
    }
  }
  attr {
    key: "scale"
    value {
      f: 1.0
    }
  }
  attr {
    key: "seed"
    value {
      i: 100
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim: 162
        dim: 200
      }
    }
  }
  attr {
    key: "var_name"
    value {
      s: "tf_model/f1/kernel"
    }
  }
  attr {
    key: "var_type"
    value {
      s: "index"
    }
  }
}
node {
  name: "/PsPullOp_17"
  op: "PsPullOp"
  device {
    device_name: "CPU"
  }
  attr {
    key: "dtype"
    value {
      type: kFloat
    }
  }
  attr {
    key: "var_name"
    value {
      s: "tf_model/f1/kernel"
    }
  }
  attr {
    key: "var_type"
    value {
      s: "index"
    }
  }
}
node {
  name: "/PsIsInitializedOp_18"
  op: "PsIsInitializedOp"
  device {
    device_name: "CPU"
  }
  attr {
    key: "var_name"
    value {
      s: "tf_model/f1/bias"
    }
  }
}
node {
  name: "/PsRegisterVariableOp_18"
  op: "PsRegisterVariableOp"
  device {
    device_name: "CPU"
  }
  attr {
    key: "dtype"
    value {
      type: kFloat
    }
  }
  attr {
    key: "extra_info"
    value {
      s: ""
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim: 200
      }
    }
  }
  attr {
    key: "var_name"
    value {
      s: "tf_model/f1/bias"
    }
  }
  attr {
    key: "var_type"
    value {
      s: "index"
    }
  }
}
node {
  name: "/PsConstantInitializerOp_7"
  op: "PsConstantInitializerOp"
  device {
    device_name: "CPU"
  }
  attr {
    key: "value"
    value {
      f: 0.0
    }
  }
  attr {
    key: "var_name"
    value {
      s: "tf_model/f1/bias"
    }
  }
  attr {
    key: "var_type"
    value {
      s: "index"
    }
  }
}
node {
  name: "/PsPullOp_18"
  op: "PsPullOp"
  device {
    device_name: "CPU"
  }
  attr {
    key: "dtype"
    value {
      type: kFloat
    }
  }
  attr {
    key: "var_name"
    value {
      s: "tf_model/f1/bias"
    }
  }
  attr {
    key: "var_type"
    value {
      s: "index"
    }
  }
}
node {
  name: "/PsIsInitializedOp_19"
  op: "PsIsInitializedOp"
  device {
    device_name: "CPU"
  }
  attr {
    key: "var_name"
    value {
      s: "tf_model/dice_1/alphadice_1"
    }
  }
}
node {
  name: "/PsRegisterVariableOp_19"
  op: "PsRegisterVariableOp"
  device {
    device_name: "CPU"
  }
  attr {
    key: "dtype"
    value {
      type: kFloat
    }
  }
  attr {
    key: "extra_info"
    value {
      s: ""
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim: 200
      }
    }
  }
  attr {
    key: "var_name"
    value {
      s: "tf_model/dice_1/alphadice_1"
    }
  }
  attr {
    key: "var_type"
    value {
      s: "index"
    }
  }
}
node {
  name: "/PsConstantInitializerOp_8"
  op: "PsConstantInitializerOp"
  device {
    device_name: "CPU"
  }
  attr {
    key: "value"
    value {
      f: 0.0
    }
  }
  attr {
    key: "var_name"
    value {
      s: "tf_model/dice_1/alphadice_1"
    }
  }
  attr {
    key: "var_type"
    value {
      s: "index"
    }
  }
}
node {
  name: "/PsPullOp_19"
  op: "PsPullOp"
  device {
    device_name: "CPU"
  }
  attr {
    key: "dtype"
    value {
      type: kFloat
    }
  }
  attr {
    key: "var_name"
    value {
      s: "tf_model/dice_1/alphadice_1"
    }
  }
  attr {
    key: "var_type"
    value {
      s: "index"
    }
  }
}
node {
  name: "/PsIsInitializedOp_20"
  op: "PsIsInitializedOp"
  device {
    device_name: "CPU"
  }
  attr {
    key: "var_name"
    value {
      s: "tf_model/f2/kernel"
    }
  }
}
node {
  name: "/PsRegisterVariableOp_20"
  op: "PsRegisterVariableOp"
  device {
    device_name: "CPU"
  }
  attr {
    key: "dtype"
    value {
      type: kFloat
    }
  }
  attr {
    key: "extra_info"
    value {
      s: ""
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim: 200
        dim: 80
      }
    }
  }
  attr {
    key: "var_name"
    value {
      s: "tf_model/f2/kernel"
    }
  }
  attr {
    key: "var_type"
    value {
      s: "index"
    }
  }
}
node {
  name: "/PsVarianceScalingInitializerOp_11"
  op: "PsVarianceScalingInitializerOp"
  device {
    device_name: "CPU"
  }
  attr {
    key: "distribution"
    value {
      s: "normal"
    }
  }
  attr {
    key: "mode"
    value {
      s: "fan_avg"
    }
  }
  attr {
    key: "scale"
    value {
      f: 1.0
    }
  }
  attr {
    key: "seed"
    value {
      i: 100
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim: 200
        dim: 80
      }
    }
  }
  attr {
    key: "var_name"
    value {
      s: "tf_model/f2/kernel"
    }
  }
  attr {
    key: "var_type"
    value {
      s: "index"
    }
  }
}
node {
  name: "/PsPullOp_20"
  op: "PsPullOp"
  device {
    device_name: "CPU"
  }
  attr {
    key: "dtype"
    value {
      type: kFloat
    }
  }
  attr {
    key: "var_name"
    value {
      s: "tf_model/f2/kernel"
    }
  }
  attr {
    key: "var_type"
    value {
      s: "index"
    }
  }
}
node {
  name: "/PsIsInitializedOp_21"
  op: "PsIsInitializedOp"
  device {
    device_name: "CPU"
  }
  attr {
    key: "var_name"
    value {
      s: "tf_model/f2/bias"
    }
  }
}
node {
  name: "/PsRegisterVariableOp_21"
  op: "PsRegisterVariableOp"
  device {
    device_name: "CPU"
  }
  attr {
    key: "dtype"
    value {
      type: kFloat
    }
  }
  attr {
    key: "extra_info"
    value {
      s: ""
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim: 80
      }
    }
  }
  attr {
    key: "var_name"
    value {
      s: "tf_model/f2/bias"
    }
  }
  attr {
    key: "var_type"
    value {
      s: "index"
    }
  }
}
node {
  name: "/PsConstantInitializerOp_9"
  op: "PsConstantInitializerOp"
  device {
    device_name: "CPU"
  }
  attr {
    key: "value"
    value {
      f: 0.0
    }
  }
  attr {
    key: "var_name"
    value {
      s: "tf_model/f2/bias"
    }
  }
  attr {
    key: "var_type"
    value {
      s: "index"
    }
  }
}
node {
  name: "/PsPullOp_21"
  op: "PsPullOp"
  device {
    device_name: "CPU"
  }
  attr {
    key: "dtype"
    value {
      type: kFloat
    }
  }
  attr {
    key: "var_name"
    value {
      s: "tf_model/f2/bias"
    }
  }
  attr {
    key: "var_type"
    value {
      s: "index"
    }
  }
}
node {
  name: "/PsIsInitializedOp_22"
  op: "PsIsInitializedOp"
  device {
    device_name: "CPU"
  }
  attr {
    key: "var_name"
    value {
      s: "tf_model/dice_2/alphadice_2"
    }
  }
}
node {
  name: "/PsRegisterVariableOp_22"
  op: "PsRegisterVariableOp"
  device {
    device_name: "CPU"
  }
  attr {
    key: "dtype"
    value {
      type: kFloat
    }
  }
  attr {
    key: "extra_info"
    value {
      s: ""
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim: 80
      }
    }
  }
  attr {
    key: "var_name"
    value {
      s: "tf_model/dice_2/alphadice_2"
    }
  }
  attr {
    key: "var_type"
    value {
      s: "index"
    }
  }
}
node {
  name: "/PsConstantInitializerOp_10"
  op: "PsConstantInitializerOp"
  device {
    device_name: "CPU"
  }
  attr {
    key: "value"
    value {
      f: 0.0
    }
  }
  attr {
    key: "var_name"
    value {
      s: "tf_model/dice_2/alphadice_2"
    }
  }
  attr {
    key: "var_type"
    value {
      s: "index"
    }
  }
}
node {
  name: "/PsPullOp_22"
  op: "PsPullOp"
  device {
    device_name: "CPU"
  }
  attr {
    key: "dtype"
    value {
      type: kFloat
    }
  }
  attr {
    key: "var_name"
    value {
      s: "tf_model/dice_2/alphadice_2"
    }
  }
  attr {
    key: "var_type"
    value {
      s: "index"
    }
  }
}
node {
  name: "/PsIsInitializedOp_23"
  op: "PsIsInitializedOp"
  device {
    device_name: "CPU"
  }
  attr {
    key: "var_name"
    value {
      s: "tf_model/f3/kernel"
    }
  }
}
node {
  name: "/PsRegisterVariableOp_23"
  op: "PsRegisterVariableOp"
  device {
    device_name: "CPU"
  }
  attr {
    key: "dtype"
    value {
      type: kFloat
    }
  }
  attr {
    key: "extra_info"
    value {
      s: ""
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim: 80
        dim: 2
      }
    }
  }
  attr {
    key: "var_name"
    value {
      s: "tf_model/f3/kernel"
    }
  }
  attr {
    key: "var_type"
    value {
      s: "index"
    }
  }
}
node {
  name: "/PsVarianceScalingInitializerOp_12"
  op: "PsVarianceScalingInitializerOp"
  device {
    device_name: "CPU"
  }
  attr {
    key: "distribution"
    value {
      s: "normal"
    }
  }
  attr {
    key: "mode"
    value {
      s: "fan_avg"
    }
  }
  attr {
    key: "scale"
    value {
      f: 1.0
    }
  }
  attr {
    key: "seed"
    value {
      i: 100
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim: 80
        dim: 2
      }
    }
  }
  attr {
    key: "var_name"
    value {
      s: "tf_model/f3/kernel"
    }
  }
  attr {
    key: "var_type"
    value {
      s: "index"
    }
  }
}
node {
  name: "/PsPullOp_23"
  op: "PsPullOp"
  device {
    device_name: "CPU"
  }
  attr {
    key: "dtype"
    value {
      type: kFloat
    }
  }
  attr {
    key: "var_name"
    value {
      s: "tf_model/f3/kernel"
    }
  }
  attr {
    key: "var_type"
    value {
      s: "index"
    }
  }
}
node {
  name: "/PsIsInitializedOp_24"
  op: "PsIsInitializedOp"
  device {
    device_name: "CPU"
  }
  attr {
    key: "var_name"
    value {
      s: "tf_model/f3/bias"
    }
  }
}
node {
  name: "/PsRegisterVariableOp_24"
  op: "PsRegisterVariableOp"
  device {
    device_name: "CPU"
  }
  attr {
    key: "dtype"
    value {
      type: kFloat
    }
  }
  attr {
    key: "extra_info"
    value {
      s: ""
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim: 2
      }
    }
  }
  attr {
    key: "var_name"
    value {
      s: "tf_model/f3/bias"
    }
  }
  attr {
    key: "var_type"
    value {
      s: "index"
    }
  }
}
node {
  name: "/PsConstantInitializerOp_11"
  op: "PsConstantInitializerOp"
  device {
    device_name: "CPU"
  }
  attr {
    key: "value"
    value {
      f: 0.0
    }
  }
  attr {
    key: "var_name"
    value {
      s: "tf_model/f3/bias"
    }
  }
  attr {
    key: "var_type"
    value {
      s: "index"
    }
  }
}
node {
  name: "/PsPullOp_24"
  op: "PsPullOp"
  device {
    device_name: "CPU"
  }
  attr {
    key: "dtype"
    value {
      type: kFloat
    }
  }
  attr {
    key: "var_name"
    value {
      s: "tf_model/f3/bias"
    }
  }
  attr {
    key: "var_type"
    value {
      s: "index"
    }
  }
}
node {
  name: "/TFBackendOp"
  op: "TFBackendOp"
  input: "/KSum:0"
  input: "/KSum_1:0"
  input: "/KSum_2:0"
  input: "/KSum_3:0"
  input: "/KSum_4:0"
  input: "/KSum_5:0"
  input: "/KSum_6:0"
  input: "/_PyFunc:21"
  input: "/_PyFunc:22"
  input: "/_PyFunc:23"
  input: "/_PyFunc:24"
  input: "/_PyFunc:25"
  input: "/_PyFunc:26"
  input: "/_PyFunc:27"
  input: "/_PyFunc:28"
  input: "/PsPullOp_7:0"
  input: "/PsPullOp_8:0"
  input: "/PsPullOp_9:0"
  input: "/PsPullOp_10:0"
  input: "/PsPullOp_11:0"
  input: "/PsPullOp_12:0"
  input: "/PsPullOp_13:0"
  input: "/PsPullOp_14:0"
  input: "/PsPullOp_15:0"
  input: "/PsPullOp_16:0"
  input: "/PsPullOp_17:0"
  input: "/PsPullOp_18:0"
  input: "/PsPullOp_19:0"
  input: "/PsPullOp_20:0"
  input: "/PsPullOp_21:0"
  input: "/PsPullOp_22:0"
  input: "/PsPullOp_23:0"
  input: "/PsPullOp_24:0"
  device {
    device_name: "CPU"
  }
  attr {
    key: "gpu_memory_fraction"
    value {
      f: 0.5
    }
  }
  attr {
    key: "gradient_op_names"
    value {
      s: "Identity:0,Identity_1:0,Identity_2:0,Identity_3:0,Identity_4:0,Identity_5:0,Identity_6:0,Identity_7:0,Identity_8:0,Identity_9:0,Identity_10:0,Identity_11:0,Identity_12:0,Identity_13:0,Identity_14:0,Identity_15:0,Identity_16:0,Identity_17:0,Identity_18:0,Identity_19:0,Identity_20:0"
    }
  }
  attr {
    key: "gradient_size"
    value {
      i: 21
    }
  }
  attr {
    key: "graph_def"
    value {
