node {
  name: "/GetBatch"
  op: "GetBatch"
  device {
    device_name: "CPU"
  }
  attr {
    key: "dense_count"
    value {
      i: 0
    }
  }
  attr {
    key: "ds"
    value {
      s: "tdm"
    }
  }
  attr {
    key: "dtype"
    value {
      type: kFloat
    }
  }
  attr {
    key: "indicator_count"
    value {
      i: 1
    }
  }
  attr {
    key: "sparse_count"
    value {
      i: 70
    }
  }
}
node {
  name: "/PsIsInitializedOp"
  op: "PsIsInitializedOp"
  device {
    device_name: "CPU"
  }
  attr {
    key: "var_name"
    value {
      s: "item_emb"
    }
  }
}
node {
  name: "/PsRegisterVariableOp"
  op: "PsRegisterVariableOp"
  device {
    device_name: "CPU"
  }
  attr {
    key: "dtype"
    value {
      type: kFloat
    }
  }
  attr {
    key: "extra_info"
    value {
      s: "batch_read=3000;"
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim: 50000
        dim: 24
      }
    }
  }
  attr {
    key: "var_name"
    value {
      s: "item_emb"
    }
  }
  attr {
    key: "var_type"
    value {
      s: "hash"
    }
  }
}
node {
  name: "/PsNormalInitializerOp"
  op: "PsNormalInitializerOp"
  device {
    device_name: "CPU"
  }
  attr {
    key: "mean"
    value {
      f: 0.0
    }
  }
  attr {
    key: "seed"
    value {
      i: 100
    }
  }
  attr {
    key: "stddev"
    value {
      f: 0.0010000000475
    }
  }
  attr {
    key: "var_name"
    value {
      s: "item_emb"
    }
  }
  attr {
    key: "var_type"
    value {
      s: "hash"
    }
  }
}
node {
  name: "/PsPullOp"
  op: "PsPullOp"
  device {
    device_name: "CPU"
  }
  attr {
    key: "dtype"
    value {
      type: kFloat
    }
  }
  attr {
    key: "var_name"
    value {
      s: "item_emb"
    }
  }
  attr {
    key: "var_type"
    value {
      s: "hash"
    }
  }
}
node {
  name: "/Unique"
  op: "Unique"
  input: "/GetBatch:71"
  device {
    device_name: "CPU"
  }
  attr {
    key: "dtype"
    value {
      type: kInt64
    }
  }
  attr {
    key: "itype"
    value {
      type: kInt32
    }
  }
}
node {
  name: "/PsSparsePullOp"
  op: "PsSparsePullOp"
  input: "/Unique:0"
  device {
    device_name: "CPU"
  }
  attr {
    key: "dtype"
    value {
      type: kInt64
    }
  }
  attr {
    key: "otype"
    value {
      type: kFloat
    }
  }
  attr {
    key: "save_ratio"
    value {
      f: 1.0
    }
  }
  attr {
    key: "var_name"
    value {
      s: "item_emb"
    }
  }
  attr {
    key: "var_type"
    value {
      s: "hash"
    }
  }
}
node {
  name: "/_Constant"
  op: "_Constant"
  device {
    device_name: "CPU"
  }
  attr {
    key: "dtype"
    value {
      type: kInt32
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim: 0
      }
    }
  }
  attr {
    key: "value"
    value {
      s: ""
    }
  }
}
node {
  name: "/KSum"
  op: "KSum"
  input: "/PsSparsePullOp:0"
  input: "/Unique:1"
  input: "/GetBatch:211"
  input: "/GetBatch:141"
  input: "/_Constant:0"
  device {
    device_name: "CPU"
  }
  attr {
    key: "average"
    value {
      b: true
    }
  }
  attr {
    key: "dtype"
    value {
      type: kFloat
    }
  }
  attr {
    key: "itype"
    value {
      type: kInt32
    }
  }
}
node {
  name: "/TakeOp"
  op: "TakeOp"
  input: "/KSum:0"
  input: "/GetBatch:0"
  device {
    device_name: "GPU"
  }
  attr {
    key: "dtype"
    value {
      type: kFloat
    }
  }
  attr {
    key: "itype"
    value {
      type: kInt32
    }
  }
}
node {
  name: "/PsIsInitializedOp_1"
  op: "PsIsInitializedOp"
  device {
    device_name: "CPU"
  }
  attr {
    key: "var_name"
    value {
      s: "item_emb"
    }
  }
}
node {
  name: "/PsRegisterVariableOp_1"
  op: "PsRegisterVariableOp"
  device {
    device_name: "CPU"
  }
  attr {
    key: "dtype"
    value {
      type: kFloat
    }
  }
  attr {
    key: "extra_info"
    value {
      s: "batch_read=3000;"
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim: 50000
        dim: 24
      }
    }
  }
  attr {
    key: "var_name"
    value {
      s: "item_emb"
    }
  }
  attr {
    key: "var_type"
    value {
      s: "hash"
    }
  }
}
node {
  name: "/PsNormalInitializerOp_1"
  op: "PsNormalInitializerOp"
  device {
    device_name: "CPU"
  }
  attr {
    key: "mean"
    value {
      f: 0.0
    }
  }
  attr {
    key: "seed"
    value {
      i: 100
    }
  }
  attr {
    key: "stddev"
    value {
      f: 0.0010000000475
    }
  }
  attr {
    key: "var_name"
    value {
      s: "item_emb"
    }
  }
  attr {
    key: "var_type"
    value {
      s: "hash"
    }
  }
}
node {
  name: "/PsPullOp_1"
  op: "PsPullOp"
  device {
    device_name: "CPU"
  }
  attr {
    key: "dtype"
    value {
      type: kFloat
    }
  }
  attr {
    key: "var_name"
    value {
      s: "item_emb"
    }
  }
  attr {
    key: "var_type"
    value {
      s: "hash"
    }
  }
}
node {
  name: "/Unique_1"
  op: "Unique"
  input: "/GetBatch:72"
  device {
    device_name: "CPU"
  }
  attr {
    key: "dtype"
    value {
      type: kInt64
    }
  }
  attr {
    key: "itype"
    value {
      type: kInt32
    }
  }
}
node {
  name: "/PsSparsePullOp_1"
  op: "PsSparsePullOp"
  input: "/Unique_1:0"
  device {
    device_name: "CPU"
  }
  attr {
    key: "dtype"
    value {
      type: kInt64
    }
  }
  attr {
    key: "otype"
    value {
      type: kFloat
    }
  }
  attr {
    key: "save_ratio"
    value {
      f: 1.0
    }
  }
  attr {
    key: "var_name"
    value {
      s: "item_emb"
    }
  }
  attr {
    key: "var_type"
    value {
      s: "hash"
    }
  }
}
node {
  name: "/_Constant_1"
  op: "_Constant"
  device {
    device_name: "CPU"
  }
  attr {
    key: "dtype"
    value {
      type: kInt32
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim: 0
      }
    }
  }
  attr {
    key: "value"
    value {
      s: ""
    }
  }
}
node {
  name: "/KSum_1"
  op: "KSum"
  input: "/PsSparsePullOp_1:0"
  input: "/Unique_1:1"
  input: "/GetBatch:212"
  input: "/GetBatch:142"
  input: "/_Constant_1:0"
  device {
    device_name: "CPU"
  }
  attr {
    key: "average"
    value {
      b: true
    }
  }
  attr {
    key: "dtype"
    value {
      type: kFloat
    }
  }
  attr {
    key: "itype"
    value {
      type: kInt32
    }
  }
}
node {
  name: "/TakeOp_1"
  op: "TakeOp"
  input: "/KSum_1:0"
  input: "/GetBatch:0"
  device {
    device_name: "GPU"
  }
  attr {
    key: "dtype"
    value {
      type: kFloat
    }
  }
  attr {
    key: "itype"
    value {
      type: kInt32
    }
  }
}
node {
  name: "/PsIsInitializedOp_2"
  op: "PsIsInitializedOp"
  device {
    device_name: "CPU"
  }
  attr {
    key: "var_name"
    value {
      s: "item_emb"
    }
  }
}
node {
  name: "/PsRegisterVariableOp_2"
  op: "PsRegisterVariableOp"
  device {
    device_name: "CPU"
  }
  attr {
    key: "dtype"
    value {
      type: kFloat
    }
  }
  attr {
    key: "extra_info"
    value {
      s: "batch_read=3000;"
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim: 50000
        dim: 24
      }
    }
  }
  attr {
    key: "var_name"
    value {
      s: "item_emb"
    }
  }
  attr {
    key: "var_type"
    value {
      s: "hash"
    }
  }
}
node {
  name: "/PsNormalInitializerOp_2"
  op: "PsNormalInitializerOp"
  device {
    device_name: "CPU"
  }
  attr {
    key: "mean"
    value {
      f: 0.0
    }
  }
  attr {
    key: "seed"
    value {
      i: 100
    }
  }
  attr {
    key: "stddev"
    value {
      f: 0.0010000000475
    }
  }
  attr {
    key: "var_name"
    value {
      s: "item_emb"
    }
  }
  attr {
    key: "var_type"
    value {
      s: "hash"
    }
  }
}
node {
  name: "/PsPullOp_2"
  op: "PsPullOp"
  device {
    device_name: "CPU"
  }
  attr {
    key: "dtype"
    value {
      type: kFloat
    }
  }
  attr {
    key: "var_name"
    value {
      s: "item_emb"
    }
  }
  attr {
    key: "var_type"
    value {
      s: "hash"
    }
  }
}
node {
  name: "/Unique_2"
  op: "Unique"
  input: "/GetBatch:73"
  device {
    device_name: "CPU"
  }
  attr {
    key: "dtype"
    value {
      type: kInt64
    }
  }
  attr {
    key: "itype"
    value {
      type: kInt32
    }
  }
}
node {
  name: "/PsSparsePullOp_2"
  op: "PsSparsePullOp"
  input: "/Unique_2:0"
  device {
    device_name: "CPU"
  }
  attr {
    key: "dtype"
    value {
      type: kInt64
    }
  }
  attr {
    key: "otype"
    value {
      type: kFloat
    }
  }
  attr {
    key: "save_ratio"
    value {
      f: 1.0
    }
  }
  attr {
    key: "var_name"
    value {
      s: "item_emb"
    }
  }
  attr {
    key: "var_type"
    value {
      s: "hash"
    }
  }
}
node {
  name: "/_Constant_2"
  op: "_Constant"
  device {
    device_name: "CPU"
  }
  attr {
    key: "dtype"
    value {
      type: kInt32
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim: 0
      }
    }
  }
  attr {
    key: "value"
    value {
      s: ""
    }
  }
}
node {
  name: "/KSum_2"
  op: "KSum"
  input: "/PsSparsePullOp_2:0"
  input: "/Unique_2:1"
  input: "/GetBatch:213"
  input: "/GetBatch:143"
  input: "/_Constant_2:0"
  device {
    device_name: "CPU"
  }
  attr {
    key: "average"
    value {
      b: true
    }
  }
  attr {
    key: "dtype"
    value {
      type: kFloat
    }
  }
  attr {
    key: "itype"
    value {
      type: kInt32
    }
  }
}
node {
  name: "/TakeOp_2"
  op: "TakeOp"
  input: "/KSum_2:0"
  input: "/GetBatch:0"
  device {
    device_name: "GPU"
  }
  attr {
    key: "dtype"
    value {
      type: kFloat
    }
  }
  attr {
    key: "itype"
    value {
      type: kInt32
    }
  }
}
node {
  name: "/PsIsInitializedOp_3"
  op: "PsIsInitializedOp"
  device {
    device_name: "CPU"
  }
  attr {
    key: "var_name"
    value {
      s: "item_emb"
    }
  }
}
node {
  name: "/PsRegisterVariableOp_3"
  op: "PsRegisterVariableOp"
  device {
    device_name: "CPU"
  }
  attr {
    key: "dtype"
    value {
      type: kFloat
    }
  }
  attr {
    key: "extra_info"
    value {
      s: "batch_read=3000;"
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim: 50000
        dim: 24
      }
    }
  }
  attr {
    key: "var_name"
    value {
      s: "item_emb"
    }
  }
  attr {
    key: "var_type"
    value {
      s: "hash"
    }
  }
}
node {
  name: "/PsNormalInitializerOp_3"
  op: "PsNormalInitializerOp"
  device {
    device_name: "CPU"
  }
  attr {
    key: "mean"
    value {
      f: 0.0
    }
  }
  attr {
    key: "seed"
    value {
      i: 100
    }
  }
  attr {
    key: "stddev"
    value {
      f: 0.0010000000475
    }
  }
  attr {
    key: "var_name"
    value {
      s: "item_emb"
    }
  }
  attr {
    key: "var_type"
    value {
      s: "hash"
    }
  }
}
node {
  name: "/PsPullOp_3"
  op: "PsPullOp"
  device {
    device_name: "CPU"
  }
  attr {
    key: "dtype"
    value {
      type: kFloat
    }
  }
  attr {
    key: "var_name"
    value {
      s: "item_emb"
    }
  }
  attr {
    key: "var_type"
    value {
      s: "hash"
    }
  }
}
node {
  name: "/Unique_3"
  op: "Unique"
  input: "/GetBatch:74"
  device {
    device_name: "CPU"
  }
  attr {
    key: "dtype"
    value {
      type: kInt64
    }
  }
  attr {
    key: "itype"
    value {
      type: kInt32
    }
  }
}
node {
  name: "/PsSparsePullOp_3"
  op: "PsSparsePullOp"
  input: "/Unique_3:0"
  device {
    device_name: "CPU"
  }
  attr {
    key: "dtype"
    value {
      type: kInt64
    }
  }
  attr {
    key: "otype"
    value {
      type: kFloat
    }
  }
  attr {
    key: "save_ratio"
    value {
      f: 1.0
    }
  }
  attr {
    key: "var_name"
    value {
      s: "item_emb"
    }
  }
  attr {
    key: "var_type"
    value {
      s: "hash"
    }
  }
}
node {
  name: "/_Constant_3"
  op: "_Constant"
  device {
    device_name: "CPU"
  }
  attr {
    key: "dtype"
    value {
      type: kInt32
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim: 0
      }
    }
  }
  attr {
    key: "value"
    value {
      s: ""
    }
  }
}
node {
  name: "/KSum_3"
  op: "KSum"
  input: "/PsSparsePullOp_3:0"
  input: "/Unique_3:1"
  input: "/GetBatch:214"
  input: "/GetBatch:144"
  input: "/_Constant_3:0"
  device {
    device_name: "CPU"
  }
  attr {
    key: "average"
    value {
      b: true
    }
  }
  attr {
    key: "dtype"
    value {
      type: kFloat
    }
  }
  attr {
    key: "itype"
    value {
      type: kInt32
    }
  }
}
node {
  name: "/TakeOp_3"
  op: "TakeOp"
  input: "/KSum_3:0"
  input: "/GetBatch:0"
  device {
    device_name: "GPU"
  }
  attr {
    key: "dtype"
    value {
      type: kFloat
    }
  }
  attr {
    key: "itype"
    value {
      type: kInt32
    }
  }
}
node {
  name: "/PsIsInitializedOp_4"
  op: "PsIsInitializedOp"
  device {
    device_name: "CPU"
  }
  attr {
    key: "var_name"
    value {
      s: "item_emb"
    }
  }
}
node {
  name: "/PsRegisterVariableOp_4"
  op: "PsRegisterVariableOp"
  device {
    device_name: "CPU"
  }
  attr {
    key: "dtype"
    value {
      type: kFloat
    }
  }
  attr {
    key: "extra_info"
    value {
      s: "batch_read=3000;"
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim: 50000
        dim: 24
      }
    }
  }
  attr {
    key: "var_name"
    value {
      s: "item_emb"
    }
  }
  attr {
    key: "var_type"
    value {
      s: "hash"
    }
  }
}
node {
  name: "/PsNormalInitializerOp_4"
  op: "PsNormalInitializerOp"
  device {
    device_name: "CPU"
  }
  attr {
    key: "mean"
    value {
      f: 0.0
    }
  }
  attr {
    key: "seed"
    value {
      i: 100
    }
  }
  attr {
    key: "stddev"
    value {
      f: 0.0010000000475
    }
  }
  attr {
    key: "var_name"
    value {
      s: "item_emb"
    }
  }
  attr {
    key: "var_type"
    value {
      s: "hash"
    }
  }
}
node {
  name: "/PsPullOp_4"
  op: "PsPullOp"
  device {
    device_name: "CPU"
  }
  attr {
    key: "dtype"
    value {
      type: kFloat
    }
  }
  attr {
    key: "var_name"
    value {
      s: "item_emb"
    }
  }
  attr {
    key: "var_type"
    value {
      s: "hash"
    }
  }
}
node {
  name: "/Unique_4"
  op: "Unique"
  input: "/GetBatch:75"
  device {
    device_name: "CPU"
  }
  attr {
    key: "dtype"
    value {
      type: kInt64
    }
  }
  attr {
    key: "itype"
    value {
      type: kInt32
    }
  }
}
node {
  name: "/PsSparsePullOp_4"
  op: "PsSparsePullOp"
  input: "/Unique_4:0"
  device {
    device_name: "CPU"
  }
  attr {
    key: "dtype"
    value {
      type: kInt64
    }
  }
  attr {
    key: "otype"
    value {
      type: kFloat
    }
  }
  attr {
    key: "save_ratio"
    value {
      f: 1.0
    }
  }
  attr {
    key: "var_name"
    value {
      s: "item_emb"
    }
  }
  attr {
    key: "var_type"
    value {
      s: "hash"
    }
  }
}
node {
  name: "/_Constant_4"
  op: "_Constant"
  device {
    device_name: "CPU"
  }
  attr {
    key: "dtype"
    value {
      type: kInt32
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim: 0
      }
    }
  }
  attr {
    key: "value"
    value {
      s: ""
    }
  }
}
node {
  name: "/KSum_4"
  op: "KSum"
  input: "/PsSparsePullOp_4:0"
  input: "/Unique_4:1"
  input: "/GetBatch:215"
  input: "/GetBatch:145"
  input: "/_Constant_4:0"
  device {
    device_name: "CPU"
  }
  attr {
    key: "average"
    value {
      b: true
    }
  }
  attr {
    key: "dtype"
    value {
      type: kFloat
    }
  }
  attr {
    key: "itype"
    value {
      type: kInt32
    }
  }
}
node {
  name: "/TakeOp_4"
  op: "TakeOp"
  input: "/KSum_4:0"
  input: "/GetBatch:0"
  device {
    device_name: "GPU"
  }
  attr {
    key: "dtype"
    value {
      type: kFloat
    }
  }
  attr {
    key: "itype"
    value {
      type: kInt32
    }
  }
}
node {
  name: "/PsIsInitializedOp_5"
  op: "PsIsInitializedOp"
  device {
    device_name: "CPU"
  }
  attr {
    key: "var_name"
    value {
      s: "item_emb"
    }
  }
}
node {
  name: "/PsRegisterVariableOp_5"
  op: "PsRegisterVariableOp"
  device {
    device_name: "CPU"
  }
  attr {
    key: "dtype"
    value {
      type: kFloat
    }
  }
  attr {
    key: "extra_info"
    value {
      s: "batch_read=3000;"
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim: 50000
        dim: 24
      }
    }
  }
  attr {
    key: "var_name"
    value {
      s: "item_emb"
    }
  }
  attr {
    key: "var_type"
    value {
      s: "hash"
    }
  }
}
node {
  name: "/PsNormalInitializerOp_5"
  op: "PsNormalInitializerOp"
  device {
    device_name: "CPU"
  }
  attr {
    key: "mean"
    value {
      f: 0.0
    }
  }
  attr {
    key: "seed"
    value {
      i: 100
    }
  }
  attr {
    key: "stddev"
    value {
      f: 0.0010000000475
    }
  }
  attr {
    key: "var_name"
    value {
      s: "item_emb"
    }
  }
  attr {
    key: "var_type"
    value {
      s: "hash"
    }
  }
}
node {
  name: "/PsPullOp_5"
  op: "PsPullOp"
  device {
    device_name: "CPU"
  }
  attr {
    key: "dtype"
    value {
      type: kFloat
    }
  }
  attr {
    key: "var_name"
    value {
      s: "item_emb"
    }
  }
  attr {
    key: "var_type"
    value {
      s: "hash"
    }
  }
}
node {
  name: "/Unique_5"
  op: "Unique"
  input: "/GetBatch:76"
  device {
    device_name: "CPU"
  }
  attr {
    key: "dtype"
    value {
      type: kInt64
    }
  }
  attr {
    key: "itype"
    value {
      type: kInt32
    }
  }
}
node {
  name: "/PsSparsePullOp_5"
  op: "PsSparsePullOp"
  input: "/Unique_5:0"
  device {
    device_name: "CPU"
  }
  attr {
    key: "dtype"
    value {
      type: kInt64
    }
  }
  attr {
    key: "otype"
    value {
      type: kFloat
    }
  }
  attr {
    key: "save_ratio"
    value {
      f: 1.0
    }
  }
  attr {
    key: "var_name"
    value {
      s: "item_emb"
    }
  }
  attr {
    key: "var_type"
    value {
      s: "hash"
    }
  }
}
node {
  name: "/_Constant_5"
  op: "_Constant"
  device {
    device_name: "CPU"
  }
  attr {
    key: "dtype"
    value {
      type: kInt32
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim: 0
      }
    }
  }
  attr {
    key: "value"
    value {
      s: ""
    }
  }
}
node {
  name: "/KSum_5"
  op: "KSum"
  input: "/PsSparsePullOp_5:0"
  input: "/Unique_5:1"
  input: "/GetBatch:216"
  input: "/GetBatch:146"
  input: "/_Constant_5:0"
  device {
    device_name: "CPU"
  }
  attr {
    key: "average"
    value {
      b: true
    }
  }
  attr {
    key: "dtype"
    value {
      type: kFloat
    }
  }
  attr {
    key: "itype"
    value {
      type: kInt32
    }
  }
}
node {
  name: "/TakeOp_5"
  op: "TakeOp"
  input: "/KSum_5:0"
  input: "/GetBatch:0"
  device {
    device_name: "GPU"
  }
  attr {
    key: "dtype"
    value {
      type: kFloat
    }
  }
  attr {
    key: "itype"
    value {
      type: kInt32
    }
  }
}
node {
  name: "/PsIsInitializedOp_6"
  op: "PsIsInitializedOp"
  device {
    device_name: "CPU"
  }
  attr {
    key: "var_name"
    value {
      s: "item_emb"
    }
  }
}
node {
  name: "/PsRegisterVariableOp_6"
  op: "PsRegisterVariableOp"
  device {
    device_name: "CPU"
  }
  attr {
    key: "dtype"
    value {
      type: kFloat
    }
  }
  attr {
    key: "extra_info"
    value {
      s: "batch_read=3000;"
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim: 50000
        dim: 24
      }
    }
  }
  attr {
    key: "var_name"
    value {
      s: "item_emb"
    }
  }
  attr {
    key: "var_type"
    value {
      s: "hash"
    }
  }
}
node {
  name: "/PsNormalInitializerOp_6"
  op: "PsNormalInitializerOp"
  device {
    device_name: "CPU"
  }
  attr {
    key: "mean"
    value {
      f: 0.0
    }
  }
  attr {
    key: "seed"
    value {
      i: 100
    }
  }
  attr {
    key: "stddev"
    value {
      f: 0.0010000000475
    }
  }
  attr {
    key: "var_name"
    value {
      s: "item_emb"
    }
  }
  attr {
    key: "var_type"
    value {
      s: "hash"
    }
  }
}
node {
  name: "/PsPullOp_6"
  op: "PsPullOp"
  device {
    device_name: "CPU"
  }
  attr {
    key: "dtype"
    value {
      type: kFloat
    }
  }
  attr {
    key: "var_name"
    value {
      s: "item_emb"
    }
  }
  attr {
    key: "var_type"
    value {
      s: "hash"
    }
  }
}
node {
  name: "/Unique_6"
  op: "Unique"
  input: "/GetBatch:77"
  device {
    device_name: "CPU"
  }
  attr {
    key: "dtype"
    value {
      type: kInt64
    }
  }
  attr {
    key: "itype"
    value {
      type: kInt32
    }
  }
}
node {
  name: "/PsSparsePullOp_6"
  op: "PsSparsePullOp"
  input: "/Unique_6:0"
  device {
    device_name: "CPU"
  }
  attr {
    key: "dtype"
    value {
      type: kInt64
    }
  }
  attr {
    key: "otype"
    value {
      type: kFloat
    }
  }
  attr {
    key: "save_ratio"
    value {
      f: 1.0
    }
  }
  attr {
    key: "var_name"
    value {
      s: "item_emb"
    }
  }
  attr {
    key: "var_type"
    value {
      s: "hash"
    }
  }
}
node {
  name: "/_Constant_6"
  op: "_Constant"
  device {
    device_name: "CPU"
  }
  attr {
    key: "dtype"
    value {
      type: kInt32
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim: 0
      }
    }
  }
  attr {
    key: "value"
    value {
      s: ""
    }
  }
}
node {
  name: "/KSum_6"
  op: "KSum"
  input: "/PsSparsePullOp_6:0"
  input: "/Unique_6:1"
  input: "/GetBatch:217"
  input: "/GetBatch:147"
  input: "/_Constant_6:0"
  device {
    device_name: "CPU"
  }
  attr {
    key: "average"
    value {
      b: true
    }
  }
  attr {
    key: "dtype"
    value {
      type: kFloat
    }
  }
  attr {
    key: "itype"
    value {
      type: kInt32
    }
  }
}
node {
  name: "/TakeOp_6"
  op: "TakeOp"
  input: "/KSum_6:0"
  input: "/GetBatch:0"
  device {
    device_name: "GPU"
  }
  attr {
    key: "dtype"
    value {
      type: kFloat
    }
  }
  attr {
    key: "itype"
    value {
      type: kInt32
    }
  }
}
node {
  name: "/PsIsInitializedOp_7"
  op: "PsIsInitializedOp"
  device {
    device_name: "CPU"
  }
  attr {
    key: "var_name"
    value {
      s: "item_emb"
    }
  }
}
node {
  name: "/PsRegisterVariableOp_7"
  op: "PsRegisterVariableOp"
  device {
    device_name: "CPU"
  }
  attr {
    key: "dtype"
    value {
      type: kFloat
    }
  }
  attr {
    key: "extra_info"
    value {
      s: "batch_read=3000;"
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim: 50000
        dim: 24
      }
    }
  }
  attr {
    key: "var_name"
    value {
      s: "item_emb"
    }
  }
  attr {
    key: "var_type"
    value {
      s: "hash"
    }
  }
}
node {
  name: "/PsNormalInitializerOp_7"
  op: "PsNormalInitializerOp"
  device {
    device_name: "CPU"
  }
  attr {
    key: "mean"
    value {
      f: 0.0
    }
  }
  attr {
    key: "seed"
    value {
      i: 100
    }
  }
  attr {
    key: "stddev"
    value {
      f: 0.0010000000475
    }
  }
  attr {
    key: "var_name"
    value {
      s: "item_emb"
    }
  }
  attr {
    key: "var_type"
    value {
      s: "hash"
    }
  }
}
node {
  name: "/PsPullOp_7"
  op: "PsPullOp"
  device {
    device_name: "CPU"
  }
  attr {
    key: "dtype"
    value {
      type: kFloat
    }
  }
  attr {
    key: "var_name"
    value {
      s: "item_emb"
    }
  }
  attr {
    key: "var_type"
    value {
      s: "hash"
    }
  }
}
node {
  name: "/Unique_7"
  op: "Unique"
  input: "/GetBatch:78"
  device {
    device_name: "CPU"
  }
  attr {
    key: "dtype"
    value {
      type: kInt64
    }
  }
  attr {
    key: "itype"
    value {
      type: kInt32
    }
  }
}
node {
  name: "/PsSparsePullOp_7"
  op: "PsSparsePullOp"
  input: "/Unique_7:0"
  device {
    device_name: "CPU"
  }
  attr {
    key: "dtype"
    value {
      type: kInt64
    }
  }
  attr {
    key: "otype"
    value {
      type: kFloat
    }
  }
  attr {
    key: "save_ratio"
    value {
      f: 1.0
    }
  }
  attr {
    key: "var_name"
    value {
      s: "item_emb"
    }
  }
  attr {
    key: "var_type"
    value {
      s: "hash"
    }
  }
}
node {
  name: "/_Constant_7"
  op: "_Constant"
  device {
    device_name: "CPU"
  }
  attr {
    key: "dtype"
    value {
      type: kInt32
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim: 0
      }
    }
  }
  attr {
    key: "value"
    value {
      s: ""
    }
  }
}
node {
  name: "/KSum_7"
  op: "KSum"
  input: "/PsSparsePullOp_7:0"
  input: "/Unique_7:1"
  input: "/GetBatch:218"
  input: "/GetBatch:148"
  input: "/_Constant_7:0"
  device {
    device_name: "CPU"
  }
  attr {
    key: "average"
    value {
      b: true
    }
  }
  attr {
    key: "dtype"
    value {
      type: kFloat
    }
  }
  attr {
    key: "itype"
    value {
      type: kInt32
    }
  }
}
node {
  name: "/TakeOp_7"
  op: "TakeOp"
  input: "/KSum_7:0"
  input: "/GetBatch:0"
  device {
    device_name: "GPU"
  }
  attr {
    key: "dtype"
    value {
      type: kFloat
    }
  }
  attr {
    key: "itype"
    value {
      type: kInt32
    }
  }
}
node {
  name: "/PsIsInitializedOp_8"
  op: "PsIsInitializedOp"
  device {
    device_name: "CPU"
  }
  attr {
    key: "var_name"
    value {
      s: "item_emb"
    }
  }
}
node {
  name: "/PsRegisterVariableOp_8"
  op: "PsRegisterVariableOp"
  device {
    device_name: "CPU"
  }
  attr {
    key: "dtype"
    value {
      type: kFloat
    }
  }
  attr {
    key: "extra_info"
    value {
      s: "batch_read=3000;"
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim: 50000
        dim: 24
      }
    }
  }
  attr {
    key: "var_name"
    value {
      s: "item_emb"
    }
  }
  attr {
    key: "var_type"
    value {
      s: "hash"
    }
  }
}
node {
  name: "/PsNormalInitializerOp_8"
  op: "PsNormalInitializerOp"
  device {
    device_name: "CPU"
  }
  attr {
    key: "mean"
    value {
      f: 0.0
    }
  }
  attr {
    key: "seed"
    value {
      i: 100
    }
  }
  attr {
    key: "stddev"
    value {
      f: 0.0010000000475
    }
  }
  attr {
    key: "var_name"
    value {
      s: "item_emb"
    }
  }
  attr {
    key: "var_type"
    value {
      s: "hash"
    }
  }
}
node {
  name: "/PsPullOp_8"
  op: "PsPullOp"
  device {
    device_name: "CPU"
  }
  attr {
    key: "dtype"
    value {
      type: kFloat
    }
  }
  attr {
    key: "var_name"
    value {
      s: "item_emb"
    }
  }
  attr {
    key: "var_type"
    value {
      s: "hash"
    }
  }
}
node {
  name: "/Unique_8"
  op: "Unique"
  input: "/GetBatch:79"
  device {
    device_name: "CPU"
  }
  attr {
    key: "dtype"
    value {
      type: kInt64
    }
  }
  attr {
    key: "itype"
    value {
      type: kInt32
    }
  }
}
node {
  name: "/PsSparsePullOp_8"
  op: "PsSparsePullOp"
  input: "/Unique_8:0"
  device {
    device_name: "CPU"
  }
  attr {
    key: "dtype"
    value {
      type: kInt64
    }
  }
  attr {
    key: "otype"
    value {
      type: kFloat
    }
  }
  attr {
    key: "save_ratio"
    value {
      f: 1.0
    }
  }
  attr {
    key: "var_name"
    value {
      s: "item_emb"
    }
  }
  attr {
    key: "var_type"
    value {
      s: "hash"
    }
  }
}
node {
  name: "/_Constant_8"
  op: "_Constant"
  device {
    device_name: "CPU"
  }
  attr {
    key: "dtype"
    value {
      type: kInt32
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim: 0
      }
    }
  }
  attr {
    key: "value"
    value {
      s: ""
    }
  }
}
node {
  name: "/KSum_8"
  op: "KSum"
  input: "/PsSparsePullOp_8:0"
  input: "/Unique_8:1"
  input: "/GetBatch:219"
  input: "/GetBatch:149"
  input: "/_Constant_8:0"
  device {
    device_name: "CPU"
  }
  attr {
    key: "average"
    value {
      b: true
    }
  }
  attr {
    key: "dtype"
    value {
      type: kFloat
    }
  }
  attr {
    key: "itype"
    value {
      type: kInt32
    }
  }
}
node {
  name: "/TakeOp_8"
  op: "TakeOp"
  input: "/KSum_8:0"
  input: "/GetBatch:0"
  device {
    device_name: "GPU"
  }
  attr {
    key: "dtype"
    value {
      type: kFloat
    }
  }
  attr {
    key: "itype"
    value {
      type: kInt32
    }
  }
}
node {
  name: "/PsIsInitializedOp_9"
  op: "PsIsInitializedOp"
  device {
    device_name: "CPU"
  }
  attr {
    key: "var_name"
    value {
      s: "item_emb"
    }
  }
}
node {
  name: "/PsRegisterVariableOp_9"
  op: "PsRegisterVariableOp"
  device {
    device_name: "CPU"
  }
  attr {
    key: "dtype"
    value {
      type: kFloat
    }
  }
  attr {
    key: "extra_info"
    value {
      s: "batch_read=3000;"
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim: 50000
        dim: 24
      }
    }
  }
  attr {
    key: "var_name"
    value {
      s: "item_emb"
    }
  }
  attr {
    key: "var_type"
    value {
      s: "hash"
    }
  }
}
node {
  name: "/PsNormalInitializerOp_9"
  op: "PsNormalInitializerOp"
  device {
    device_name: "CPU"
  }
  attr {
    key: "mean"
    value {
      f: 0.0
    }
  }
  attr {
    key: "seed"
    value {
      i: 100
    }
  }
  attr {
    key: "stddev"
    value {
      f: 0.0010000000475
    }
  }
  attr {
    key: "var_name"
    value {
      s: "item_emb"
    }
  }
  attr {
    key: "var_type"
    value {
      s: "hash"
    }
  }
}
node {
  name: "/PsPullOp_9"
  op: "PsPullOp"
  device {
    device_name: "CPU"
  }
  attr {
    key: "dtype"
    value {
      type: kFloat
    }
  }
  attr {
    key: "var_name"
    value {
      s: "item_emb"
    }
  }
  attr {
    key: "var_type"
    value {
      s: "hash"
    }
  }
}
node {
  name: "/Unique_9"
  op: "Unique"
  input: "/GetBatch:80"
  device {
    device_name: "CPU"
  }
  attr {
    key: "dtype"
    value {
      type: kInt64
    }
  }
  attr {
    key: "itype"
    value {
      type: kInt32
    }
  }
}
node {
  name: "/PsSparsePullOp_9"
  op: "PsSparsePullOp"
  input: "/Unique_9:0"
  device {
    device_name: "CPU"
  }
  attr {
    key: "dtype"
    value {
      type: kInt64
    }
  }
  attr {
    key: "otype"
    value {
      type: kFloat
    }
  }
  attr {
    key: "save_ratio"
    value {
      f: 1.0
    }
  }
  attr {
    key: "var_name"
    value {
      s: "item_emb"
    }
  }
  attr {
    key: "var_type"
    value {
      s: "hash"
    }
  }
}
node {
  name: "/_Constant_9"
  op: "_Constant"
  device {
    device_name: "CPU"
  }
  attr {
    key: "dtype"
    value {
      type: kInt32
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim: 0
      }
    }
  }
  attr {
    key: "value"
    value {
      s: ""
    }
  }
}
node {
  name: "/KSum_9"
  op: "KSum"
  input: "/PsSparsePullOp_9:0"
  input: "/Unique_9:1"
  input: "/GetBatch:220"
  input: "/GetBatch:150"
  input: "/_Constant_9:0"
  device {
    device_name: "CPU"
  }
  attr {
    key: "average"
    value {
      b: true
    }
  }
  attr {
    key: "dtype"
    value {
      type: kFloat
    }
  }
  attr {
    key: "itype"
    value {
      type: kInt32
    }
  }
}
node {
  name: "/TakeOp_9"
  op: "TakeOp"
  input: "/KSum_9:0"
  input: "/GetBatch:0"
  device {
    device_name: "GPU"
  }
  attr {
    key: "dtype"
    value {
      type: kFloat
    }
  }
  attr {
    key: "itype"
    value {
      type: kInt32
    }
  }
}
node {
  name: "/PsIsInitializedOp_10"
  op: "PsIsInitializedOp"
  device {
    device_name: "CPU"
  }
  attr {
    key: "var_name"
    value {
      s: "item_emb"
    }
  }
}
node {
  name: "/PsRegisterVariableOp_10"
  op: "PsRegisterVariableOp"
  device {
    device_name: "CPU"
  }
  attr {
    key: "dtype"
    value {
      type: kFloat
    }
  }
  attr {
    key: "extra_info"
    value {
      s: "batch_read=3000;"
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim: 50000
        dim: 24
      }
    }
  }
  attr {
    key: "var_name"
    value {
      s: "item_emb"
    }
  }
  attr {
    key: "var_type"
    value {
      s: "hash"
    }
  }
}
node {
  name: "/PsNormalInitializerOp_10"
  op: "PsNormalInitializerOp"
  device {
    device_name: "CPU"
  }
  attr {
    key: "mean"
    value {
      f: 0.0
    }
  }
  attr {
    key: "seed"
    value {
      i: 100
    }
  }
  attr {
    key: "stddev"
    value {
      f: 0.0010000000475
    }
  }
  attr {
    key: "var_name"
    value {
      s: "item_emb"
    }
  }
  attr {
    key: "var_type"
    value {
      s: "hash"
    }
  }
}
node {
  name: "/PsPullOp_10"
  op: "PsPullOp"
  device {
    device_name: "CPU"
  }
  attr {
    key: "dtype"
    value {
      type: kFloat
    }
  }
  attr {
    key: "var_name"
    value {
      s: "item_emb"
    }
  }
  attr {
    key: "var_type"
    value {
      s: "hash"
    }
  }
}
node {
  name: "/Unique_10"
  op: "Unique"
  input: "/GetBatch:81"
  device {
    device_name: "CPU"
  }
  attr {
    key: "dtype"
    value {
      type: kInt64
    }
  }
  attr {
    key: "itype"
    value {
      type: kInt32
    }
  }
}
node {
  name: "/PsSparsePullOp_10"
  op: "PsSparsePullOp"
  input: "/Unique_10:0"
  device {
    device_name: "CPU"
  }
  attr {
    key: "dtype"
    value {
      type: kInt64
    }
  }
  attr {
    key: "otype"
    value {
      type: kFloat
    }
  }
  attr {
    key: "save_ratio"
    value {
      f: 1.0
    }
  }
  attr {
    key: "var_name"
    value {
      s: "item_emb"
    }
  }
  attr {
    key: "var_type"
    value {
      s: "hash"
    }
  }
}
node {
  name: "/_Constant_10"
  op: "_Constant"
  device {
    device_name: "CPU"
  }
  attr {
    key: "dtype"
    value {
      type: kInt32
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim: 0
      }
    }
  }
  attr {
    key: "value"
    value {
      s: ""
    }
  }
}
node {
  name: "/KSum_10"
  op: "KSum"
  input: "/PsSparsePullOp_10:0"
  input: "/Unique_10:1"
  input: "/GetBatch:221"
  input: "/GetBatch:151"
  input: "/_Constant_10:0"
  device {
    device_name: "CPU"
  }
  attr {
    key: "average"
    value {
      b: true
    }
  }
  attr {
    key: "dtype"
    value {
      type: kFloat
    }
  }
  attr {
    key: "itype"
    value {
      type: kInt32
    }
  }
}
node {
  name: "/TakeOp_10"
  op: "TakeOp"
  input: "/KSum_10:0"
  input: "/GetBatch:0"
  device {
    device_name: "GPU"
  }
  attr {
    key: "dtype"
    value {
      type: kFloat
    }
  }
  attr {
    key: "itype"
    value {
      type: kInt32
    }
  }
}
node {
  name: "/PsIsInitializedOp_11"
  op: "PsIsInitializedOp"
  device {
    device_name: "CPU"
  }
  attr {
    key: "var_name"
    value {
      s: "item_emb"
    }
  }
}
node {
  name: "/PsRegisterVariableOp_11"
  op: "PsRegisterVariableOp"
  device {
    device_name: "CPU"
  }
  attr {
    key: "dtype"
    value {
      type: kFloat
    }
  }
  attr {
    key: "extra_info"
    value {
      s: "batch_read=3000;"
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim: 50000
        dim: 24
      }
    }
  }
  attr {
    key: "var_name"
    value {
      s: "item_emb"
    }
  }
  attr {
    key: "var_type"
    value {
      s: "hash"
    }
  }
}
node {
  name: "/PsNormalInitializerOp_11"
  op: "PsNormalInitializerOp"
  device {
    device_name: "CPU"
  }
  attr {
    key: "mean"
    value {
      f: 0.0
    }
  }
  attr {
    key: "seed"
    value {
      i: 100
    }
  }
  attr {
    key: "stddev"
    value {
      f: 0.0010000000475
    }
  }
  attr {
    key: "var_name"
    value {
      s: "item_emb"
    }
  }
  attr {
    key: "var_type"
    value {
      s: "hash"
    }
  }
}
node {
  name: "/PsPullOp_11"
  op: "PsPullOp"
  device {
    device_name: "CPU"
  }
  attr {
    key: "dtype"
    value {
      type: kFloat
    }
  }
  attr {
    key: "var_name"
    value {
      s: "item_emb"
    }
  }
  attr {
    key: "var_type"
    value {
      s: "hash"
    }
  }
}
node {
  name: "/Unique_11"
  op: "Unique"
  input: "/GetBatch:82"
  device {
    device_name: "CPU"
  }
  attr {
    key: "dtype"
    value {
      type: kInt64
    }
  }
  attr {
    key: "itype"
    value {
      type: kInt32
    }
  }
}
node {
  name: "/PsSparsePullOp_11"
  op: "PsSparsePullOp"
  input: "/Unique_11:0"
  device {
    device_name: "CPU"
  }
  attr {
    key: "dtype"
    value {
      type: kInt64
    }
  }
  attr {
    key: "otype"
    value {
      type: kFloat
    }
  }
  attr {
    key: "save_ratio"
    value {
      f: 1.0
    }
  }
  attr {
    key: "var_name"
    value {
      s: "item_emb"
    }
  }
  attr {
    key: "var_type"
    value {
      s: "hash"
    }
  }
}
node {
  name: "/_Constant_11"
  op: "_Constant"
  device {
    device_name: "CPU"
  }
  attr {
    key: "dtype"
    value {
      type: kInt32
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim: 0
      }
    }
  }
  attr {
    key: "value"
    value {
      s: ""
    }
  }
}
node {
  name: "/KSum_11"
  op: "KSum"
  input: "/PsSparsePullOp_11:0"
  input: "/Unique_11:1"
  input: "/GetBatch:222"
  input: "/GetBatch:152"
  input: "/_Constant_11:0"
  device {
    device_name: "CPU"
  }
  attr {
    key: "average"
    value {
      b: true
    }
  }
  attr {
    key: "dtype"
    value {
      type: kFloat
    }
  }
  attr {
    key: "itype"
    value {
      type: kInt32
    }
  }
}
node {
  name: "/TakeOp_11"
  op: "TakeOp"
  input: "/KSum_11:0"
  input: "/GetBatch:0"
  device {
    device_name: "GPU"
  }
  attr {
    key: "dtype"
    value {
      type: kFloat
    }
  }
  attr {
    key: "itype"
    value {
      type: kInt32
    }
  }
}
node {
  name: "/PsIsInitializedOp_12"
  op: "PsIsInitializedOp"
  device {
    device_name: "CPU"
  }
  attr {
    key: "var_name"
    value {
      s: "item_emb"
    }
  }
}
node {
  name: "/PsRegisterVariableOp_12"
  op: "PsRegisterVariableOp"
  device {
    device_name: "CPU"
  }
  attr {
    key: "dtype"
    value {
      type: kFloat
    }
  }
  attr {
    key: "extra_info"
    value {
      s: "batch_read=3000;"
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim: 50000
        dim: 24
      }
    }
  }
  attr {
    key: "var_name"
    value {
      s: "item_emb"
    }
  }
  attr {
    key: "var_type"
    value {
      s: "hash"
    }
  }
}
node {
  name: "/PsNormalInitializerOp_12"
  op: "PsNormalInitializerOp"
  device {
    device_name: "CPU"
  }
  attr {
    key: "mean"
    value {
      f: 0.0
    }
  }
  attr {
    key: "seed"
    value {
      i: 100
    }
  }
  attr {
    key: "stddev"
    value {
      f: 0.0010000000475
    }
  }
  attr {
    key: "var_name"
    value {
      s: "item_emb"
    }
  }
  attr {
    key: "var_type"
    value {
      s: "hash"
    }
  }
}
node {
  name: "/PsPullOp_12"
  op: "PsPullOp"
  device {
    device_name: "CPU"
  }
  attr {
    key: "dtype"
    value {
      type: kFloat
    }
  }
  attr {
    key: "var_name"
    value {
      s: "item_emb"
    }
  }
  attr {
    key: "var_type"
    value {
      s: "hash"
    }
  }
}
node {
  name: "/Unique_12"
  op: "Unique"
  input: "/GetBatch:83"
  device {
    device_name: "CPU"
  }
  attr {
    key: "dtype"
    value {
      type: kInt64
    }
  }
  attr {
    key: "itype"
    value {
      type: kInt32
    }
  }
}
node {
  name: "/PsSparsePullOp_12"
  op: "PsSparsePullOp"
  input: "/Unique_12:0"
  device {
    device_name: "CPU"
  }
  attr {
    key: "dtype"
    value {
      type: kInt64
    }
  }
  attr {
    key: "otype"
    value {
      type: kFloat
    }
  }
  attr {
    key: "save_ratio"
    value {
      f: 1.0
    }
  }
  attr {
    key: "var_name"
    value {
      s: "item_emb"
    }
  }
  attr {
    key: "var_type"
    value {
      s: "hash"
    }
  }
}
node {
  name: "/_Constant_12"
  op: "_Constant"
  device {
    device_name: "CPU"
  }
  attr {
    key: "dtype"
    value {
      type: kInt32
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim: 0
      }
    }
  }
  attr {
    key: "value"
    value {
      s: ""
    }
  }
}
node {
  name: "/KSum_12"
  op: "KSum"
  input: "/PsSparsePullOp_12:0"
  input: "/Unique_12:1"
  input: "/GetBatch:223"
  input: "/GetBatch:153"
  input: "/_Constant_12:0"
  device {
    device_name: "CPU"
  }
  attr {
    key: "average"
    value {
      b: true
    }
  }
  attr {
    key: "dtype"
    value {
      type: kFloat
    }
  }
  attr {
    key: "itype"
    value {
      type: kInt32
    }
  }
}
node {
  name: "/TakeOp_12"
  op: "TakeOp"
  input: "/KSum_12:0"
  input: "/GetBatch:0"
  device {
    device_name: "GPU"
  }
  attr {
    key: "dtype"
    value {
      type: kFloat
    }
  }
  attr {
    key: "itype"
    value {
      type: kInt32
    }
  }
}
node {
  name: "/PsIsInitializedOp_13"
  op: "PsIsInitializedOp"
  device {
    device_name: "CPU"
  }
  attr {
    key: "var_name"
    value {
      s: "item_emb"
    }
  }
}
node {
  name: "/PsRegisterVariableOp_13"
  op: "PsRegisterVariableOp"
  device {
    device_name: "CPU"
  }
  attr {
    key: "dtype"
    value {
      type: kFloat
    }
  }
  attr {
    key: "extra_info"
    value {
      s: "batch_read=3000;"
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim: 50000
        dim: 24
      }
    }
  }
  attr {
    key: "var_name"
    value {
      s: "item_emb"
    }
  }
  attr {
    key: "var_type"
    value {
      s: "hash"
    }
  }
}
node {
  name: "/PsNormalInitializerOp_13"
  op: "PsNormalInitializerOp"
  device {
    device_name: "CPU"
  }
  attr {
    key: "mean"
    value {
      f: 0.0
    }
  }
  attr {
    key: "seed"
    value {
      i: 100
    }
  }
  attr {
    key: "stddev"
    value {
      f: 0.0010000000475
    }
  }
  attr {
    key: "var_name"
    value {
      s: "item_emb"
    }
  }
  attr {
    key: "var_type"
    value {
      s: "hash"
    }
  }
}
node {
  name: "/PsPullOp_13"
  op: "PsPullOp"
  device {
    device_name: "CPU"
  }
  attr {
    key: "dtype"
    value {
      type: kFloat
    }
  }
  attr {
    key: "var_name"
    value {
      s: "item_emb"
    }
  }
  attr {
    key: "var_type"
    value {
      s: "hash"
    }
  }
}
node {
  name: "/Unique_13"
  op: "Unique"
  input: "/GetBatch:84"
  device {
    device_name: "CPU"
  }
  attr {
    key: "dtype"
    value {
      type: kInt64
    }
  }
  attr {
    key: "itype"
    value {
      type: kInt32
    }
  }
}
node {
  name: "/PsSparsePullOp_13"
  op: "PsSparsePullOp"
  input: "/Unique_13:0"
  device {
    device_name: "CPU"
  }
  attr {
    key: "dtype"
    value {
      type: kInt64
    }
  }
  attr {
    key: "otype"
    value {
      type: kFloat
    }
  }
  attr {
    key: "save_ratio"
    value {
      f: 1.0
    }
  }
  attr {
    key: "var_name"
    value {
      s: "item_emb"
    }
  }
  attr {
    key: "var_type"
    value {
      s: "hash"
    }
  }
}
node {
  name: "/_Constant_13"
  op: "_Constant"
  device {
    device_name: "CPU"
  }
  attr {
    key: "dtype"
    value {
      type: kInt32
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim: 0
      }
    }
  }
  attr {
    key: "value"
    value {
      s: ""
    }
  }
}
node {
  name: "/KSum_13"
  op: "KSum"
  input: "/PsSparsePullOp_13:0"
  input: "/Unique_13:1"
  input: "/GetBatch:224"
  input: "/GetBatch:154"
  input: "/_Constant_13:0"
  device {
    device_name: "CPU"
  }
  attr {
    key: "average"
    value {
      b: true
    }
  }
  attr {
    key: "dtype"
    value {
      type: kFloat
    }
  }
  attr {
    key: "itype"
    value {
      type: kInt32
    }
  }
}
node {
  name: "/TakeOp_13"
  op: "TakeOp"
  input: "/KSum_13:0"
  input: "/GetBatch:0"
  device {
    device_name: "GPU"
  }
  attr {
    key: "dtype"
    value {
      type: kFloat
    }
  }
  attr {
    key: "itype"
    value {
      type: kInt32
    }
  }
}
node {
  name: "/PsIsInitializedOp_14"
  op: "PsIsInitializedOp"
  device {
    device_name: "CPU"
  }
  attr {
    key: "var_name"
    value {
      s: "item_emb"
    }
  }
}
node {
  name: "/PsRegisterVariableOp_14"
  op: "PsRegisterVariableOp"
  device {
    device_name: "CPU"
  }
  attr {
    key: "dtype"
    value {
      type: kFloat
    }
  }
  attr {
    key: "extra_info"
    value {
      s: "batch_read=3000;"
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim: 50000
        dim: 24
      }
    }
  }
  attr {
    key: "var_name"
    value {
      s: "item_emb"
    }
  }
  attr {
    key: "var_type"
    value {
      s: "hash"
    }
  }
}
node {
  name: "/PsNormalInitializerOp_14"
  op: "PsNormalInitializerOp"
  device {
    device_name: "CPU"
  }
  attr {
    key: "mean"
    value {
      f: 0.0
    }
  }
  attr {
    key: "seed"
    value {
      i: 100
    }
  }
  attr {
    key: "stddev"
    value {
      f: 0.0010000000475
    }
  }
  attr {
    key: "var_name"
    value {
      s: "item_emb"
    }
  }
  attr {
    key: "var_type"
    value {
      s: "hash"
    }
  }
}
node {
  name: "/PsPullOp_14"
  op: "PsPullOp"
  device {
    device_name: "CPU"
  }
  attr {
    key: "dtype"
    value {
      type: kFloat
    }
  }
  attr {
    key: "var_name"
    value {
      s: "item_emb"
    }
  }
  attr {
    key: "var_type"
    value {
      s: "hash"
    }
  }
}
node {
  name: "/Unique_14"
  op: "Unique"
  input: "/GetBatch:85"
  device {
    device_name: "CPU"
  }
  attr {
    key: "dtype"
    value {
      type: kInt64
    }
  }
  attr {
    key: "itype"
    value {
      type: kInt32
    }
  }
}
node {
  name: "/PsSparsePullOp_14"
  op: "PsSparsePullOp"
  input: "/Unique_14:0"
  device {
    device_name: "CPU"
  }
  attr {
    key: "dtype"
    value {
      type: kInt64
    }
  }
  attr {
    key: "otype"
    value {
      type: kFloat
    }
  }
  attr {
    key: "save_ratio"
    value {
      f: 1.0
    }
  }
  attr {
    key: "var_name"
    value {
      s: "item_emb"
    }
  }
  attr {
    key: "var_type"
    value {
      s: "hash"
    }
  }
}
node {
  name: "/_Constant_14"
  op: "_Constant"
  device {
    device_name: "CPU"
  }
  attr {
    key: "dtype"
    value {
      type: kInt32
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim: 0
      }
    }
  }
  attr {
    key: "value"
    value {
      s: ""
    }
  }
}
node {
  name: "/KSum_14"
  op: "KSum"
  input: "/PsSparsePullOp_14:0"
  input: "/Unique_14:1"
  input: "/GetBatch:225"
  input: "/GetBatch:155"
  input: "/_Constant_14:0"
  device {
    device_name: "CPU"
  }
  attr {
    key: "average"
    value {
      b: true
    }
  }
  attr {
    key: "dtype"
    value {
      type: kFloat
    }
  }
  attr {
    key: "itype"
    value {
      type: kInt32
    }
  }
}
node {
  name: "/TakeOp_14"
  op: "TakeOp"
  input: "/KSum_14:0"
  input: "/GetBatch:0"
  device {
    device_name: "GPU"
  }
  attr {
    key: "dtype"
    value {
      type: kFloat
    }
  }
  attr {
    key: "itype"
    value {
      type: kInt32
    }
  }
}
node {
  name: "/PsIsInitializedOp_15"
  op: "PsIsInitializedOp"
  device {
    device_name: "CPU"
  }
  attr {
    key: "var_name"
    value {
      s: "item_emb"
    }
  }
}
node {
  name: "/PsRegisterVariableOp_15"
  op: "PsRegisterVariableOp"
  device {
    device_name: "CPU"
  }
  attr {
    key: "dtype"
    value {
      type: kFloat
    }
  }
  attr {
    key: "extra_info"
    value {
      s: "batch_read=3000;"
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim: 50000
        dim: 24
      }
    }
  }
  attr {
    key: "var_name"
    value {
      s: "item_emb"
    }
  }
  attr {
    key: "var_type"
    value {
      s: "hash"
    }
  }
}
node {
  name: "/PsNormalInitializerOp_15"
  op: "PsNormalInitializerOp"
  device {
    device_name: "CPU"
  }
  attr {
    key: "mean"
    value {
      f: 0.0
    }
  }
  attr {
    key: "seed"
    value {
      i: 100
    }
  }
  attr {
    key: "stddev"
    value {
      f: 0.0010000000475
    }
  }
  attr {
    key: "var_name"
    value {
      s: "item_emb"
    }
  }
  attr {
    key: "var_type"
    value {
      s: "hash"
    }
  }
}
node {
  name: "/PsPullOp_15"
  op: "PsPullOp"
  device {
    device_name: "CPU"
  }
  attr {
    key: "dtype"
    value {
      type: kFloat
    }
  }
  attr {
    key: "var_name"
    value {
      s: "item_emb"
    }
  }
  attr {
    key: "var_type"
    value {
      s: "hash"
    }
  }
}
node {
  name: "/Unique_15"
  op: "Unique"
  input: "/GetBatch:86"
  device {
    device_name: "CPU"
  }
  attr {
    key: "dtype"
    value {
      type: kInt64
    }
  }
  attr {
    key: "itype"
    value {
      type: kInt32
    }
  }
}
node {
  name: "/PsSparsePullOp_15"
  op: "PsSparsePullOp"
  input: "/Unique_15:0"
  device {
    device_name: "CPU"
  }
  attr {
    key: "dtype"
    value {
      type: kInt64
    }
  }
  attr {
    key: "otype"
    value {
      type: kFloat
    }
  }
  attr {
    key: "save_ratio"
    value {
      f: 1.0
    }
  }
  attr {
    key: "var_name"
    value {
      s: "item_emb"
    }
  }
  attr {
    key: "var_type"
    value {
      s: "hash"
    }
  }
}
node {
  name: "/_Constant_15"
  op: "_Constant"
  device {
    device_name: "CPU"
  }
  attr {
    key: "dtype"
    value {
      type: kInt32
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim: 0
      }
    }
  }
  attr {
    key: "value"
    value {
      s: ""
    }
  }
}
node {
  name: "/KSum_15"
  op: "KSum"
  input: "/PsSparsePullOp_15:0"
  input: "/Unique_15:1"
  input: "/GetBatch:226"
  input: "/GetBatch:156"
  input: "/_Constant_15:0"
  device {
    device_name: "CPU"
  }
  attr {
    key: "average"
    value {
      b: true
    }
  }
  attr {
    key: "dtype"
    value {
      type: kFloat
    }
  }
  attr {
    key: "itype"
    value {
      type: kInt32
    }
  }
}
node {
  name: "/TakeOp_15"
  op: "TakeOp"
  input: "/KSum_15:0"
  input: "/GetBatch:0"
  device {
    device_name: "GPU"
  }
  attr {
    key: "dtype"
    value {
      type: kFloat
    }
  }
  attr {
    key: "itype"
    value {
      type: kInt32
    }
  }
}
node {
  name: "/PsIsInitializedOp_16"
  op: "PsIsInitializedOp"
  device {
    device_name: "CPU"
  }
  attr {
    key: "var_name"
    value {
      s: "item_emb"
    }
  }
}
node {
  name: "/PsRegisterVariableOp_16"
  op: "PsRegisterVariableOp"
  device {
    device_name: "CPU"
  }
  attr {
    key: "dtype"
