{
  "nodes": [
    {
      "op": "null", 
      "name": "dice_gamma_5", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "dice_gamma_4", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "dice_gamma_3", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "dice_gamma_2", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "dice_gamma_1", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "ncomm", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "comm", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "indicator", 
      "inputs": []
    }, 
    {
      "op": "take", 
      "name": "take0", 
      "inputs": [[6, 0, 0], [7, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "concat0", 
      "attrs": {
        "dim": "1", 
        "num_args": "2"
      }, 
      "inputs": [[5, 0, 0], [8, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "att_comm", 
      "inputs": []
    }, 
    {
      "op": "slice_axis", 
      "name": "slice_axis0", 
      "attrs": {
        "axis": "1", 
        "begin": "0", 
        "end": "900"
      }, 
      "inputs": [[10, 0, 0]]
    }, 
    {
      "op": "slice_axis", 
      "name": "slice_axis1", 
      "attrs": {
        "axis": "1", 
        "begin": "0", 
        "end": "150"
      }, 
      "inputs": [[11, 0, 0]]
    }, 
    {
      "op": "slice_axis", 
      "name": "slice_axis2", 
      "attrs": {
        "axis": "1", 
        "begin": "150", 
        "end": "300"
      }, 
      "inputs": [[11, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "concat1", 
      "attrs": {
        "dim": "2", 
        "num_args": "2"
      }, 
      "inputs": [[12, 0, 0], [13, 0, 0]]
    }, 
    {
      "op": "slice_axis", 
      "name": "slice_axis3", 
      "attrs": {
        "axis": "1", 
        "begin": "300", 
        "end": "450"
      }, 
      "inputs": [[11, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "concat2", 
      "attrs": {
        "dim": "2", 
        "num_args": "2"
      }, 
      "inputs": [[14, 0, 0], [15, 0, 0]]
    }, 
    {
      "op": "slice_axis", 
      "name": "slice_axis4", 
      "attrs": {
        "axis": "1", 
        "begin": "450", 
        "end": "600"
      }, 
      "inputs": [[11, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "concat3", 
      "attrs": {
        "dim": "2", 
        "num_args": "2"
      }, 
      "inputs": [[16, 0, 0], [17, 0, 0]]
    }, 
    {
      "op": "slice_axis", 
      "name": "slice_axis5", 
      "attrs": {
        "axis": "1", 
        "begin": "600", 
        "end": "750"
      }, 
      "inputs": [[11, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "concat4", 
      "attrs": {
        "dim": "2", 
        "num_args": "2"
      }, 
      "inputs": [[18, 0, 0], [19, 0, 0]]
    }, 
    {
      "op": "slice_axis", 
      "name": "slice_axis6", 
      "attrs": {
        "axis": "1", 
        "begin": "750", 
        "end": "900"
      }, 
      "inputs": [[11, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "concat5", 
      "attrs": {
        "dim": "2", 
        "num_args": "2"
      }, 
      "inputs": [[20, 0, 0], [21, 0, 0]]
    }, 
    {
      "op": "sum", 
      "name": "sum0", 
      "attrs": {"axis": "1"}, 
      "inputs": [[22, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape0", 
      "attrs": {"shape": "(0, 108)"}, 
      "inputs": [[23, 0, 0]]
    }, 
    {
      "op": "take", 
      "name": "take1", 
      "inputs": [[24, 0, 0], [7, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "concat16", 
      "attrs": {
        "dim": "1", 
        "num_args": "2"
      }, 
      "inputs": [[9, 0, 0], [25, 0, 0]]
    }, 
    {
      "op": "slice_axis", 
      "name": "slice_axis7", 
      "attrs": {
        "axis": "1", 
        "begin": "900", 
        "end": "1800"
      }, 
      "inputs": [[10, 0, 0]]
    }, 
    {
      "op": "slice_axis", 
      "name": "slice_axis8", 
      "attrs": {
        "axis": "1", 
        "begin": "0", 
        "end": "150"
      }, 
      "inputs": [[27, 0, 0]]
    }, 
    {
      "op": "slice_axis", 
      "name": "slice_axis9", 
      "attrs": {
        "axis": "1", 
        "begin": "150", 
        "end": "300"
      }, 
      "inputs": [[27, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "concat6", 
      "attrs": {
        "dim": "2", 
        "num_args": "2"
      }, 
      "inputs": [[28, 0, 0], [29, 0, 0]]
    }, 
    {
      "op": "slice_axis", 
      "name": "slice_axis10", 
      "attrs": {
        "axis": "1", 
        "begin": "300", 
        "end": "450"
      }, 
      "inputs": [[27, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "concat7", 
      "attrs": {
        "dim": "2", 
        "num_args": "2"
      }, 
      "inputs": [[30, 0, 0], [31, 0, 0]]
    }, 
    {
      "op": "slice_axis", 
      "name": "slice_axis11", 
      "attrs": {
        "axis": "1", 
        "begin": "450", 
        "end": "600"
      }, 
      "inputs": [[27, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "concat8", 
      "attrs": {
        "dim": "2", 
        "num_args": "2"
      }, 
      "inputs": [[32, 0, 0], [33, 0, 0]]
    }, 
    {
      "op": "slice_axis", 
      "name": "slice_axis12", 
      "attrs": {
        "axis": "1", 
        "begin": "600", 
        "end": "750"
      }, 
      "inputs": [[27, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "concat9", 
      "attrs": {
        "dim": "2", 
        "num_args": "2"
      }, 
      "inputs": [[34, 0, 0], [35, 0, 0]]
    }, 
    {
      "op": "slice_axis", 
      "name": "slice_axis13", 
      "attrs": {
        "axis": "1", 
        "begin": "750", 
        "end": "900"
      }, 
      "inputs": [[27, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "concat10", 
      "attrs": {
        "dim": "2", 
        "num_args": "2"
      }, 
      "inputs": [[36, 0, 0], [37, 0, 0]]
    }, 
    {
      "op": "sum", 
      "name": "sum1", 
      "attrs": {"axis": "1"}, 
      "inputs": [[38, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape1", 
      "attrs": {"shape": "(0, 108)"}, 
      "inputs": [[39, 0, 0]]
    }, 
    {
      "op": "take", 
      "name": "take2", 
      "inputs": [[40, 0, 0], [7, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "concat17", 
      "attrs": {
        "dim": "1", 
        "num_args": "2"
      }, 
      "inputs": [[26, 0, 0], [41, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "fc3d_16_weight", 
      "attrs": {
        "flatten": "0", 
        "num_hidden": "36"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fc3d_16_bias", 
      "attrs": {
        "flatten": "0", 
        "num_hidden": "36"
      }, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "fc3d_16", 
      "attrs": {
        "flatten": "0", 
        "num_hidden": "36"
      }, 
      "inputs": [[22, 0, 0], [43, 0, 0], [44, 0, 0]]
    }, 
    {
      "op": "take", 
      "name": "take3", 
      "inputs": [[45, 0, 0], [7, 0, 0]]
    }, 
    {
      "op": "slice_axis", 
      "name": "slice_axis23", 
      "attrs": {
        "axis": "1", 
        "begin": "72", 
        "end": "90"
      }, 
      "inputs": [[5, 0, 0]]
    }, 
    {
      "op": "slice_axis", 
      "name": "slice_axis24", 
      "attrs": {
        "axis": "1", 
        "begin": "90", 
        "end": "108"
      }, 
      "inputs": [[5, 0, 0]]
    }, 
    {
      "op": "slice_axis", 
      "name": "slice_axis26", 
      "attrs": {
        "axis": "1", 
        "begin": "126", 
        "end": "144"
      }, 
      "inputs": [[5, 0, 0]]
    }, 
    {
      "op": "slice_axis", 
      "name": "slice_axis25", 
      "attrs": {
        "axis": "1", 
        "begin": "108", 
        "end": "126"
      }, 
      "inputs": [[5, 0, 0]]
    }, 
    {
      "op": "slice_axis", 
      "name": "slice_axis28", 
      "attrs": {
        "axis": "1", 
        "begin": "234", 
        "end": "252"
      }, 
      "inputs": [[5, 0, 0]]
    }, 
    {
      "op": "slice_axis", 
      "name": "slice_axis27", 
      "attrs": {
        "axis": "1", 
        "begin": "216", 
        "end": "234"
      }, 
      "inputs": [[5, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "concat18", 
      "attrs": {
        "dim": "1", 
        "num_args": "6"
      }, 
      "inputs": [[47, 0, 0], [48, 0, 0], [49, 0, 0], [50, 0, 0], [51, 0, 0], [52, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape2", 
      "attrs": {"shape": "(0, 1, 108)"}, 
      "inputs": [[53, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "fc3d_10_weight", 
      "attrs": {
        "flatten": "0", 
        "num_hidden": "36"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fc3d_10_bias", 
      "attrs": {
        "flatten": "0", 
        "num_hidden": "36"
      }, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "fc3d_10", 
      "attrs": {
        "flatten": "0", 
        "num_hidden": "36"
      }, 
      "inputs": [[54, 0, 0], [55, 0, 0], [56, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "fc3d_11_weight", 
      "attrs": {
        "flatten": "0", 
        "num_hidden": "36"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fc3d_11_bias", 
      "attrs": {
        "flatten": "0", 
        "num_hidden": "36"
      }, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "fc3d_11", 
      "attrs": {
        "flatten": "0", 
        "num_hidden": "36"
      }, 
      "inputs": [[57, 0, 0], [58, 0, 0], [59, 0, 0]]
    }, 
    {
      "op": "batch_dot", 
      "name": "batch_dot0", 
      "attrs": {"transpose_b": "True"}, 
      "inputs": [[46, 0, 0], [60, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape3", 
      "attrs": {"shape": "(0, 150)"}, 
      "inputs": [[61, 0, 0]]
    }, 
    {
      "op": "SoftmaxActivation", 
      "name": "softmaxactivation0", 
      "inputs": [[62, 0, 0]]
    }, 
    {
      "op": "_plus_scalar", 
      "name": "_plusscalar0", 
      "attrs": {"scalar": "1e-07"}, 
      "inputs": [[63, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape4", 
      "attrs": {"shape": "(0, 0, 1)"}, 
      "inputs": [[64, 0, 0]]
    }, 
    {
      "op": "broadcast_mul", 
      "name": "broadcast_mul0", 
      "inputs": [[46, 0, 0], [65, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "fc3d_17_weight", 
      "attrs": {
        "flatten": "0", 
        "num_hidden": "36"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fc3d_17_bias", 
      "attrs": {
        "flatten": "0", 
        "num_hidden": "36"
      }, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "fc3d_17", 
      "attrs": {
        "flatten": "0", 
        "num_hidden": "36"
      }, 
      "inputs": [[22, 0, 0], [67, 0, 0], [68, 0, 0]]
    }, 
    {
      "op": "take", 
      "name": "take4", 
      "inputs": [[69, 0, 0], [7, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "fc3d_12_weight", 
      "attrs": {
        "flatten": "0", 
        "num_hidden": "36"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fc3d_12_bias", 
      "attrs": {
        "flatten": "0", 
        "num_hidden": "36"
      }, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "fc3d_12", 
      "attrs": {
        "flatten": "0", 
        "num_hidden": "36"
      }, 
      "inputs": [[54, 0, 0], [71, 0, 0], [72, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "fc3d_13_weight", 
      "attrs": {
        "flatten": "0", 
        "num_hidden": "36"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fc3d_13_bias", 
      "attrs": {
        "flatten": "0", 
        "num_hidden": "36"
      }, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "fc3d_13", 
      "attrs": {
        "flatten": "0", 
        "num_hidden": "36"
      }, 
      "inputs": [[73, 0, 0], [74, 0, 0], [75, 0, 0]]
    }, 
    {
      "op": "batch_dot", 
      "name": "batch_dot1", 
      "attrs": {"transpose_b": "True"}, 
      "inputs": [[70, 0, 0], [76, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape5", 
      "attrs": {"shape": "(0, 150)"}, 
      "inputs": [[77, 0, 0]]
    }, 
    {
      "op": "SoftmaxActivation", 
      "name": "softmaxactivation1", 
      "inputs": [[78, 0, 0]]
    }, 
    {
      "op": "_plus_scalar", 
      "name": "_plusscalar1", 
      "attrs": {"scalar": "1e-07"}, 
      "inputs": [[79, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape6", 
      "attrs": {"shape": "(0, 0, 1)"}, 
      "inputs": [[80, 0, 0]]
    }, 
    {
      "op": "broadcast_mul", 
      "name": "broadcast_mul1", 
      "inputs": [[70, 0, 0], [81, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "fc3d_18_weight", 
      "attrs": {
        "flatten": "0", 
        "num_hidden": "36"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fc3d_18_bias", 
      "attrs": {
        "flatten": "0", 
        "num_hidden": "36"
      }, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "fc3d_18", 
      "attrs": {
        "flatten": "0", 
        "num_hidden": "36"
      }, 
      "inputs": [[22, 0, 0], [83, 0, 0], [84, 0, 0]]
    }, 
    {
      "op": "take", 
      "name": "take5", 
      "inputs": [[85, 0, 0], [7, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "fc3d_14_weight", 
      "attrs": {
        "flatten": "0", 
        "num_hidden": "36"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fc3d_14_bias", 
      "attrs": {
        "flatten": "0", 
        "num_hidden": "36"
      }, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "fc3d_14", 
      "attrs": {
        "flatten": "0", 
        "num_hidden": "36"
      }, 
      "inputs": [[54, 0, 0], [87, 0, 0], [88, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "fc3d_15_weight", 
      "attrs": {
        "flatten": "0", 
        "num_hidden": "36"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fc3d_15_bias", 
      "attrs": {
        "flatten": "0", 
        "num_hidden": "36"
      }, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "fc3d_15", 
      "attrs": {
        "flatten": "0", 
        "num_hidden": "36"
      }, 
      "inputs": [[89, 0, 0], [90, 0, 0], [91, 0, 0]]
    }, 
    {
      "op": "batch_dot", 
      "name": "batch_dot2", 
      "attrs": {"transpose_b": "True"}, 
      "inputs": [[86, 0, 0], [92, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape7", 
      "attrs": {"shape": "(0, 150)"}, 
      "inputs": [[93, 0, 0]]
    }, 
    {
      "op": "SoftmaxActivation", 
      "name": "softmaxactivation2", 
      "inputs": [[94, 0, 0]]
    }, 
    {
      "op": "_plus_scalar", 
      "name": "_plusscalar2", 
      "attrs": {"scalar": "1e-07"}, 
      "inputs": [[95, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape8", 
      "attrs": {"shape": "(0, 0, 1)"}, 
      "inputs": [[96, 0, 0]]
    }, 
    {
      "op": "broadcast_mul", 
      "name": "broadcast_mul2", 
      "inputs": [[86, 0, 0], [97, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "concat19", 
      "attrs": {
        "dim": "2", 
        "num_args": "3"
      }, 
      "inputs": [[66, 0, 0], [82, 0, 0], [98, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape9", 
      "attrs": {"shape": "(0, 0, 108)"}, 
      "inputs": [[99, 0, 0]]
    }, 
    {
      "op": "sum", 
      "name": "sum_axis0", 
      "attrs": {"axis": "1"}, 
      "inputs": [[100, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "fc3d_26_weight", 
      "attrs": {
        "flatten": "0", 
        "num_hidden": "36"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fc3d_26_bias", 
      "attrs": {
        "flatten": "0", 
        "num_hidden": "36"
      }, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "fc3d_26", 
      "attrs": {
        "flatten": "0", 
        "num_hidden": "36"
      }, 
      "inputs": [[38, 0, 0], [102, 0, 0], [103, 0, 0]]
    }, 
    {
      "op": "take", 
      "name": "take6", 
      "inputs": [[104, 0, 0], [7, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "fc3d_20_weight", 
      "attrs": {
        "flatten": "0", 
        "num_hidden": "36"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fc3d_20_bias", 
      "attrs": {
        "flatten": "0", 
        "num_hidden": "36"
      }, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "fc3d_20", 
      "attrs": {
        "flatten": "0", 
        "num_hidden": "36"
      }, 
      "inputs": [[54, 0, 0], [106, 0, 0], [107, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "fc3d_21_weight", 
      "attrs": {
        "flatten": "0", 
        "num_hidden": "36"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fc3d_21_bias", 
      "attrs": {
        "flatten": "0", 
        "num_hidden": "36"
      }, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "fc3d_21", 
      "attrs": {
        "flatten": "0", 
        "num_hidden": "36"
      }, 
      "inputs": [[108, 0, 0], [109, 0, 0], [110, 0, 0]]
    }, 
    {
      "op": "batch_dot", 
      "name": "batch_dot3", 
      "attrs": {"transpose_b": "True"}, 
      "inputs": [[105, 0, 0], [111, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape10", 
      "attrs": {"shape": "(0, 150)"}, 
      "inputs": [[112, 0, 0]]
    }, 
    {
      "op": "SoftmaxActivation", 
      "name": "softmaxactivation3", 
      "inputs": [[113, 0, 0]]
    }, 
    {
      "op": "_plus_scalar", 
      "name": "_plusscalar3", 
      "attrs": {"scalar": "1e-07"}, 
      "inputs": [[114, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape11", 
      "attrs": {"shape": "(0, 0, 1)"}, 
      "inputs": [[115, 0, 0]]
    }, 
    {
      "op": "broadcast_mul", 
      "name": "broadcast_mul3", 
      "inputs": [[105, 0, 0], [116, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "fc3d_27_weight", 
      "attrs": {
        "flatten": "0", 
        "num_hidden": "36"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fc3d_27_bias", 
      "attrs": {
        "flatten": "0", 
        "num_hidden": "36"
      }, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "fc3d_27", 
      "attrs": {
        "flatten": "0", 
        "num_hidden": "36"
      }, 
      "inputs": [[38, 0, 0], [118, 0, 0], [119, 0, 0]]
    }, 
    {
      "op": "take", 
      "name": "take7", 
      "inputs": [[120, 0, 0], [7, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "fc3d_22_weight", 
      "attrs": {
        "flatten": "0", 
        "num_hidden": "36"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fc3d_22_bias", 
      "attrs": {
        "flatten": "0", 
        "num_hidden": "36"
      }, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "fc3d_22", 
      "attrs": {
        "flatten": "0", 
        "num_hidden": "36"
      }, 
      "inputs": [[54, 0, 0], [122, 0, 0], [123, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "fc3d_23_weight", 
      "attrs": {
        "flatten": "0", 
        "num_hidden": "36"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fc3d_23_bias", 
      "attrs": {
        "flatten": "0", 
        "num_hidden": "36"
      }, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "fc3d_23", 
      "attrs": {
        "flatten": "0", 
        "num_hidden": "36"
      }, 
      "inputs": [[124, 0, 0], [125, 0, 0], [126, 0, 0]]
    }, 
    {
      "op": "batch_dot", 
      "name": "batch_dot4", 
      "attrs": {"transpose_b": "True"}, 
      "inputs": [[121, 0, 0], [127, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape12", 
      "attrs": {"shape": "(0, 150)"}, 
      "inputs": [[128, 0, 0]]
    }, 
    {
      "op": "SoftmaxActivation", 
      "name": "softmaxactivation4", 
      "inputs": [[129, 0, 0]]
    }, 
    {
      "op": "_plus_scalar", 
      "name": "_plusscalar4", 
      "attrs": {"scalar": "1e-07"}, 
      "inputs": [[130, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape13", 
      "attrs": {"shape": "(0, 0, 1)"}, 
      "inputs": [[131, 0, 0]]
    }, 
    {
      "op": "broadcast_mul", 
      "name": "broadcast_mul4", 
      "inputs": [[121, 0, 0], [132, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "fc3d_28_weight", 
      "attrs": {
        "flatten": "0", 
        "num_hidden": "36"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fc3d_28_bias", 
      "attrs": {
        "flatten": "0", 
        "num_hidden": "36"
      }, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "fc3d_28", 
      "attrs": {
        "flatten": "0", 
        "num_hidden": "36"
      }, 
      "inputs": [[38, 0, 0], [134, 0, 0], [135, 0, 0]]
    }, 
    {
      "op": "take", 
      "name": "take8", 
      "inputs": [[136, 0, 0], [7, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "fc3d_24_weight", 
      "attrs": {
        "flatten": "0", 
        "num_hidden": "36"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fc3d_24_bias", 
      "attrs": {
        "flatten": "0", 
        "num_hidden": "36"
      }, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "fc3d_24", 
      "attrs": {
        "flatten": "0", 
        "num_hidden": "36"
      }, 
      "inputs": [[54, 0, 0], [138, 0, 0], [139, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "fc3d_25_weight", 
      "attrs": {
        "flatten": "0", 
        "num_hidden": "36"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fc3d_25_bias", 
      "attrs": {
        "flatten": "0", 
        "num_hidden": "36"
      }, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "fc3d_25", 
      "attrs": {
        "flatten": "0", 
        "num_hidden": "36"
      }, 
      "inputs": [[140, 0, 0], [141, 0, 0], [142, 0, 0]]
    }, 
    {
      "op": "batch_dot", 
      "name": "batch_dot5", 
      "attrs": {"transpose_b": "True"}, 
      "inputs": [[137, 0, 0], [143, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape14", 
      "attrs": {"shape": "(0, 150)"}, 
      "inputs": [[144, 0, 0]]
    }, 
    {
      "op": "SoftmaxActivation", 
      "name": "softmaxactivation5", 
      "inputs": [[145, 0, 0]]
    }, 
    {
      "op": "_plus_scalar", 
      "name": "_plusscalar5", 
      "attrs": {"scalar": "1e-07"}, 
      "inputs": [[146, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape15", 
      "attrs": {"shape": "(0, 0, 1)"}, 
      "inputs": [[147, 0, 0]]
    }, 
    {
      "op": "broadcast_mul", 
      "name": "broadcast_mul5", 
      "inputs": [[137, 0, 0], [148, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "concat20", 
      "attrs": {
        "dim": "2", 
        "num_args": "3"
      }, 
      "inputs": [[117, 0, 0], [133, 0, 0], [149, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape16", 
      "attrs": {"shape": "(0, 0, 108)"}, 
      "inputs": [[150, 0, 0]]
    }, 
    {
      "op": "sum", 
      "name": "sum_axis1", 
      "attrs": {"axis": "1"}, 
      "inputs": [[151, 0, 0]]
    }, 
    {
      "op": "slice_axis", 
      "name": "slice_axis21", 
      "attrs": {
        "axis": "1", 
        "begin": "100", 
        "end": "150"
      }, 
      "inputs": [[38, 0, 0]]
    }, 
    {
      "op": "slice_axis", 
      "name": "slice_axis29", 
      "attrs": {
        "axis": "1", 
        "begin": "0", 
        "end": "1"
      }, 
      "inputs": [[153, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "gru_40_i2h_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "gru_40_i2h_bias", 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_40_t0__i2h", 
      "attrs": {"num_hidden": "324"}, 
      "inputs": [[154, 0, 0], [155, 0, 0], [156, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_40_t0__i2h_slice", 
      "attrs": {"num_outputs": "3"}, 
      "inputs": [[157, 0, 0]]
    }, 
    {
      "op": "_zeros", 
      "name": "gru_40_begin_state_0", 
      "attrs": {
        "__layout__": "NC", 
        "dtype": "float32", 
        "shape": "(0, 108)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "gru_40_h2h_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "gru_40_h2h_bias", 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_40_t0__h2h", 
      "attrs": {"num_hidden": "324"}, 
      "inputs": [[159, 0, 0], [160, 0, 0], [161, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_40_t0__h2h_slice", 
      "attrs": {"num_outputs": "3"}, 
      "inputs": [[162, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus1", 
      "inputs": [[158, 1, 0], [163, 1, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "gru_40_t0__z_act", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[164, 0, 0]]
    }, 
    {
      "op": "_rminus_scalar", 
      "name": "_rminusscalar0", 
      "attrs": {"scalar": "1.0"}, 
      "inputs": [[165, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus0", 
      "inputs": [[158, 0, 0], [163, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "gru_40_t0__r_act", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[167, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul0", 
      "inputs": [[168, 0, 0], [163, 2, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus2", 
      "inputs": [[158, 2, 0], [169, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "gru_40_t0__h_act", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[170, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul1", 
      "inputs": [[166, 0, 0], [171, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul2", 
      "inputs": [[165, 0, 0], [159, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "gru_40_t0_out", 
      "inputs": [[172, 0, 0], [173, 0, 0]]
    }, 
    {
      "op": "_equal_scalar", 
      "name": "_equal_scalar0", 
      "attrs": {"scalar": "0"}, 
      "inputs": [[154, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape17", 
      "attrs": {"shape": "(0, 108)"}, 
      "inputs": [[175, 0, 0]]
    }, 
    {
      "op": "sum", 
      "name": "sum2", 
      "attrs": {
        "axis": "1", 
        "keepdims": "True"
      }, 
      "inputs": [[176, 0, 0]]
    }, 
    {
      "op": "_not_equal_scalar", 
      "name": "_not_equal_scalar0", 
      "attrs": {"scalar": "108"}, 
      "inputs": [[177, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape18", 
      "attrs": {"shape": "(0, 1)"}, 
      "inputs": [[178, 0, 0]]
    }, 
    {
      "op": "broadcast_mul", 
      "name": "broadcast_mul6", 
      "inputs": [[174, 0, 0], [179, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape19", 
      "attrs": {"shape": "(0, 1, 108)"}, 
      "inputs": [[180, 0, 0]]
    }, 
    {
      "op": "slice_axis", 
      "name": "slice_axis30", 
      "attrs": {
        "axis": "1", 
        "begin": "1", 
        "end": "2"
      }, 
      "inputs": [[153, 0, 0]]
    }, 
    {
      "op": "_equal_scalar", 
      "name": "_equal_scalar1", 
      "attrs": {"scalar": "0"}, 
      "inputs": [[182, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape20", 
      "attrs": {"shape": "(0, 108)"}, 
      "inputs": [[183, 0, 0]]
    }, 
    {
      "op": "sum", 
      "name": "sum3", 
      "attrs": {
        "axis": "1", 
        "keepdims": "True"
      }, 
      "inputs": [[184, 0, 0]]
    }, 
    {
      "op": "_not_equal_scalar", 
      "name": "_not_equal_scalar1", 
      "attrs": {"scalar": "108"}, 
      "inputs": [[185, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape21", 
      "attrs": {"shape": "(0, 1)"}, 
      "inputs": [[186, 0, 0]]
    }, 
    {
      "op": "_rminus_scalar", 
      "name": "_rminusscalar2", 
      "attrs": {"scalar": "1"}, 
      "inputs": [[187, 0, 0]]
    }, 
    {
      "op": "broadcast_mul", 
      "name": "broadcast_mul8", 
      "inputs": [[180, 0, 0], [188, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_40_t1__i2h", 
      "attrs": {"num_hidden": "324"}, 
      "inputs": [[182, 0, 0], [155, 0, 0], [156, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_40_t1__i2h_slice", 
      "attrs": {"num_outputs": "3"}, 
      "inputs": [[190, 0, 0]]
    }, 
    {
      "op": "broadcast_mul", 
      "name": "broadcast_mul7", 
      "inputs": [[174, 0, 0], [179, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_40_t1__h2h", 
      "attrs": {"num_hidden": "324"}, 
      "inputs": [[192, 0, 0], [160, 0, 0], [161, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_40_t1__h2h_slice", 
      "attrs": {"num_outputs": "3"}, 
      "inputs": [[193, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus4", 
      "inputs": [[191, 1, 0], [194, 1, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "gru_40_t1__z_act", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[195, 0, 0]]
    }, 
    {
      "op": "_rminus_scalar", 
      "name": "_rminusscalar1", 
      "attrs": {"scalar": "1.0"}, 
      "inputs": [[196, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus3", 
      "inputs": [[191, 0, 0], [194, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "gru_40_t1__r_act", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[198, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul3", 
      "inputs": [[199, 0, 0], [194, 2, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus5", 
      "inputs": [[191, 2, 0], [200, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "gru_40_t1__h_act", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[201, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul4", 
      "inputs": [[197, 0, 0], [202, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul5", 
      "inputs": [[196, 0, 0], [192, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "gru_40_t1_out", 
      "inputs": [[203, 0, 0], [204, 0, 0]]
    }, 
    {
      "op": "broadcast_mul", 
      "name": "broadcast_mul9", 
      "inputs": [[205, 0, 0], [187, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus6", 
      "inputs": [[189, 0, 0], [206, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape22", 
      "attrs": {"shape": "(0, 1, 108)"}, 
      "inputs": [[207, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "concat21", 
      "attrs": {
        "dim": "1", 
        "num_args": "2"
      }, 
      "inputs": [[181, 0, 0], [208, 0, 0]]
    }, 
    {
      "op": "slice_axis", 
      "name": "slice_axis31", 
      "attrs": {
        "axis": "1", 
        "begin": "2", 
        "end": "3"
      }, 
      "inputs": [[153, 0, 0]]
    }, 
    {
      "op": "_equal_scalar", 
      "name": "_equal_scalar2", 
      "attrs": {"scalar": "0"}, 
      "inputs": [[210, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape23", 
      "attrs": {"shape": "(0, 108)"}, 
      "inputs": [[211, 0, 0]]
    }, 
    {
      "op": "sum", 
      "name": "sum4", 
      "attrs": {
        "axis": "1", 
        "keepdims": "True"
      }, 
      "inputs": [[212, 0, 0]]
    }, 
    {
      "op": "_not_equal_scalar", 
      "name": "_not_equal_scalar2", 
      "attrs": {"scalar": "108"}, 
      "inputs": [[213, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape24", 
      "attrs": {"shape": "(0, 1)"}, 
      "inputs": [[214, 0, 0]]
    }, 
    {
      "op": "_rminus_scalar", 
      "name": "_rminusscalar5", 
      "attrs": {"scalar": "1"}, 
      "inputs": [[215, 0, 0]]
    }, 
    {
      "op": "broadcast_mul", 
      "name": "broadcast_mul12", 
      "inputs": [[207, 0, 0], [216, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_40_t2__i2h", 
      "attrs": {"num_hidden": "324"}, 
      "inputs": [[210, 0, 0], [155, 0, 0], [156, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_40_t2__i2h_slice", 
      "attrs": {"num_outputs": "3"}, 
      "inputs": [[218, 0, 0]]
    }, 
    {
      "op": "_rminus_scalar", 
      "name": "_rminusscalar3", 
      "attrs": {"scalar": "1"}, 
      "inputs": [[187, 0, 0]]
    }, 
    {
      "op": "broadcast_mul", 
      "name": "broadcast_mul10", 
      "inputs": [[192, 0, 0], [220, 0, 0]]
    }, 
    {
      "op": "broadcast_mul", 
      "name": "broadcast_mul11", 
      "inputs": [[205, 0, 0], [187, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus7", 
      "inputs": [[221, 0, 0], [222, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_40_t2__h2h", 
      "attrs": {"num_hidden": "324"}, 
      "inputs": [[223, 0, 0], [160, 0, 0], [161, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_40_t2__h2h_slice", 
      "attrs": {"num_outputs": "3"}, 
      "inputs": [[224, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus9", 
      "inputs": [[219, 1, 0], [225, 1, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "gru_40_t2__z_act", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[226, 0, 0]]
    }, 
    {
      "op": "_rminus_scalar", 
      "name": "_rminusscalar4", 
      "attrs": {"scalar": "1.0"}, 
      "inputs": [[227, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus8", 
      "inputs": [[219, 0, 0], [225, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "gru_40_t2__r_act", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[229, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul6", 
      "inputs": [[230, 0, 0], [225, 2, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus10", 
      "inputs": [[219, 2, 0], [231, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "gru_40_t2__h_act", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[232, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul7", 
      "inputs": [[228, 0, 0], [233, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul8", 
      "inputs": [[227, 0, 0], [223, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "gru_40_t2_out", 
      "inputs": [[234, 0, 0], [235, 0, 0]]
    }, 
    {
      "op": "broadcast_mul", 
      "name": "broadcast_mul13", 
      "inputs": [[236, 0, 0], [215, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus11", 
      "inputs": [[217, 0, 0], [237, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape25", 
      "attrs": {"shape": "(0, 1, 108)"}, 
      "inputs": [[238, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "concat23", 
      "attrs": {
        "dim": "1", 
        "num_args": "2"
      }, 
      "inputs": [[209, 0, 0], [239, 0, 0]]
    }, 
    {
      "op": "slice_axis", 
      "name": "slice_axis32", 
      "attrs": {
        "axis": "1", 
        "begin": "3", 
        "end": "4"
      }, 
      "inputs": [[153, 0, 0]]
    }, 
    {
      "op": "_equal_scalar", 
      "name": "_equal_scalar3", 
      "attrs": {"scalar": "0"}, 
      "inputs": [[241, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape26", 
      "attrs": {"shape": "(0, 108)"}, 
      "inputs": [[242, 0, 0]]
    }, 
    {
      "op": "sum", 
      "name": "sum5", 
      "attrs": {
        "axis": "1", 
        "keepdims": "True"
      }, 
      "inputs": [[243, 0, 0]]
    }, 
    {
      "op": "_not_equal_scalar", 
      "name": "_not_equal_scalar3", 
      "attrs": {"scalar": "108"}, 
      "inputs": [[244, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape27", 
      "attrs": {"shape": "(0, 1)"}, 
      "inputs": [[245, 0, 0]]
    }, 
    {
      "op": "_rminus_scalar", 
      "name": "_rminusscalar8", 
      "attrs": {"scalar": "1"}, 
      "inputs": [[246, 0, 0]]
    }, 
    {
      "op": "broadcast_mul", 
      "name": "broadcast_mul16", 
      "inputs": [[238, 0, 0], [247, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_40_t3__i2h", 
      "attrs": {"num_hidden": "324"}, 
      "inputs": [[241, 0, 0], [155, 0, 0], [156, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_40_t3__i2h_slice", 
      "attrs": {"num_outputs": "3"}, 
      "inputs": [[249, 0, 0]]
    }, 
    {
      "op": "_rminus_scalar", 
      "name": "_rminusscalar6", 
      "attrs": {"scalar": "1"}, 
      "inputs": [[215, 0, 0]]
    }, 
    {
      "op": "broadcast_mul", 
      "name": "broadcast_mul14", 
      "inputs": [[223, 0, 0], [251, 0, 0]]
    }, 
    {
      "op": "broadcast_mul", 
      "name": "broadcast_mul15", 
      "inputs": [[236, 0, 0], [215, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus12", 
      "inputs": [[252, 0, 0], [253, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_40_t3__h2h", 
      "attrs": {"num_hidden": "324"}, 
      "inputs": [[254, 0, 0], [160, 0, 0], [161, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_40_t3__h2h_slice", 
      "attrs": {"num_outputs": "3"}, 
      "inputs": [[255, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus14", 
      "inputs": [[250, 1, 0], [256, 1, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "gru_40_t3__z_act", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[257, 0, 0]]
    }, 
    {
      "op": "_rminus_scalar", 
      "name": "_rminusscalar7", 
      "attrs": {"scalar": "1.0"}, 
      "inputs": [[258, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus13", 
      "inputs": [[250, 0, 0], [256, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "gru_40_t3__r_act", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[260, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul9", 
      "inputs": [[261, 0, 0], [256, 2, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus15", 
      "inputs": [[250, 2, 0], [262, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "gru_40_t3__h_act", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[263, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul10", 
      "inputs": [[259, 0, 0], [264, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul11", 
      "inputs": [[258, 0, 0], [254, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "gru_40_t3_out", 
      "inputs": [[265, 0, 0], [266, 0, 0]]
    }, 
    {
      "op": "broadcast_mul", 
      "name": "broadcast_mul17", 
      "inputs": [[267, 0, 0], [246, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus16", 
      "inputs": [[248, 0, 0], [268, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape28", 
      "attrs": {"shape": "(0, 1, 108)"}, 
      "inputs": [[269, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "concat25", 
      "attrs": {
        "dim": "1", 
        "num_args": "2"
      }, 
      "inputs": [[240, 0, 0], [270, 0, 0]]
    }, 
    {
      "op": "slice_axis", 
      "name": "slice_axis33", 
      "attrs": {
        "axis": "1", 
        "begin": "4", 
        "end": "5"
      }, 
      "inputs": [[153, 0, 0]]
    }, 
    {
      "op": "_equal_scalar", 
      "name": "_equal_scalar4", 
      "attrs": {"scalar": "0"}, 
      "inputs": [[272, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape29", 
      "attrs": {"shape": "(0, 108)"}, 
      "inputs": [[273, 0, 0]]
    }, 
    {
      "op": "sum", 
      "name": "sum6", 
      "attrs": {
        "axis": "1", 
        "keepdims": "True"
      }, 
      "inputs": [[274, 0, 0]]
    }, 
    {
      "op": "_not_equal_scalar", 
      "name": "_not_equal_scalar4", 
      "attrs": {"scalar": "108"}, 
      "inputs": [[275, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape30", 
      "attrs": {"shape": "(0, 1)"}, 
      "inputs": [[276, 0, 0]]
    }, 
    {
      "op": "_rminus_scalar", 
      "name": "_rminusscalar11", 
      "attrs": {"scalar": "1"}, 
      "inputs": [[277, 0, 0]]
    }, 
    {
      "op": "broadcast_mul", 
      "name": "broadcast_mul20", 
      "inputs": [[269, 0, 0], [278, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_40_t4__i2h", 
      "attrs": {"num_hidden": "324"}, 
      "inputs": [[272, 0, 0], [155, 0, 0], [156, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_40_t4__i2h_slice", 
      "attrs": {"num_outputs": "3"}, 
      "inputs": [[280, 0, 0]]
    }, 
    {
      "op": "_rminus_scalar", 
      "name": "_rminusscalar9", 
      "attrs": {"scalar": "1"}, 
      "inputs": [[246, 0, 0]]
    }, 
    {
      "op": "broadcast_mul", 
      "name": "broadcast_mul18", 
      "inputs": [[254, 0, 0], [282, 0, 0]]
    }, 
    {
      "op": "broadcast_mul", 
      "name": "broadcast_mul19", 
      "inputs": [[267, 0, 0], [246, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus17", 
      "inputs": [[283, 0, 0], [284, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_40_t4__h2h", 
      "attrs": {"num_hidden": "324"}, 
      "inputs": [[285, 0, 0], [160, 0, 0], [161, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_40_t4__h2h_slice", 
      "attrs": {"num_outputs": "3"}, 
      "inputs": [[286, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus19", 
      "inputs": [[281, 1, 0], [287, 1, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "gru_40_t4__z_act", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[288, 0, 0]]
    }, 
    {
      "op": "_rminus_scalar", 
      "name": "_rminusscalar10", 
      "attrs": {"scalar": "1.0"}, 
      "inputs": [[289, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus18", 
      "inputs": [[281, 0, 0], [287, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "gru_40_t4__r_act", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[291, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul12", 
      "inputs": [[292, 0, 0], [287, 2, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus20", 
      "inputs": [[281, 2, 0], [293, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "gru_40_t4__h_act", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[294, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul13", 
      "inputs": [[290, 0, 0], [295, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul14", 
      "inputs": [[289, 0, 0], [285, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "gru_40_t4_out", 
      "inputs": [[296, 0, 0], [297, 0, 0]]
    }, 
    {
      "op": "broadcast_mul", 
      "name": "broadcast_mul21", 
      "inputs": [[298, 0, 0], [277, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus21", 
      "inputs": [[279, 0, 0], [299, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape31", 
      "attrs": {"shape": "(0, 1, 108)"}, 
      "inputs": [[300, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "concat27", 
      "attrs": {
        "dim": "1", 
        "num_args": "2"
      }, 
      "inputs": [[271, 0, 0], [301, 0, 0]]
    }, 
    {
      "op": "slice_axis", 
      "name": "slice_axis34", 
      "attrs": {
        "axis": "1", 
        "begin": "5", 
        "end": "6"
      }, 
      "inputs": [[153, 0, 0]]
    }, 
    {
      "op": "_equal_scalar", 
      "name": "_equal_scalar5", 
      "attrs": {"scalar": "0"}, 
      "inputs": [[303, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape32", 
      "attrs": {"shape": "(0, 108)"}, 
      "inputs": [[304, 0, 0]]
    }, 
    {
      "op": "sum", 
      "name": "sum7", 
      "attrs": {
        "axis": "1", 
        "keepdims": "True"
      }, 
      "inputs": [[305, 0, 0]]
    }, 
    {
      "op": "_not_equal_scalar", 
      "name": "_not_equal_scalar5", 
      "attrs": {"scalar": "108"}, 
      "inputs": [[306, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape33", 
      "attrs": {"shape": "(0, 1)"}, 
      "inputs": [[307, 0, 0]]
    }, 
    {
      "op": "_rminus_scalar", 
      "name": "_rminusscalar14", 
      "attrs": {"scalar": "1"}, 
      "inputs": [[308, 0, 0]]
    }, 
    {
      "op": "broadcast_mul", 
      "name": "broadcast_mul24", 
      "inputs": [[300, 0, 0], [309, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_40_t5__i2h", 
      "attrs": {"num_hidden": "324"}, 
      "inputs": [[303, 0, 0], [155, 0, 0], [156, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_40_t5__i2h_slice", 
      "attrs": {"num_outputs": "3"}, 
      "inputs": [[311, 0, 0]]
    }, 
    {
      "op": "_rminus_scalar", 
      "name": "_rminusscalar12", 
      "attrs": {"scalar": "1"}, 
      "inputs": [[277, 0, 0]]
    }, 
    {
      "op": "broadcast_mul", 
      "name": "broadcast_mul22", 
      "inputs": [[285, 0, 0], [313, 0, 0]]
    }, 
    {
      "op": "broadcast_mul", 
      "name": "broadcast_mul23", 
      "inputs": [[298, 0, 0], [277, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus22", 
      "inputs": [[314, 0, 0], [315, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_40_t5__h2h", 
      "attrs": {"num_hidden": "324"}, 
      "inputs": [[316, 0, 0], [160, 0, 0], [161, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_40_t5__h2h_slice", 
      "attrs": {"num_outputs": "3"}, 
      "inputs": [[317, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus24", 
      "inputs": [[312, 1, 0], [318, 1, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "gru_40_t5__z_act", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[319, 0, 0]]
    }, 
    {
      "op": "_rminus_scalar", 
      "name": "_rminusscalar13", 
      "attrs": {"scalar": "1.0"}, 
      "inputs": [[320, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus23", 
      "inputs": [[312, 0, 0], [318, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "gru_40_t5__r_act", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[322, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul15", 
      "inputs": [[323, 0, 0], [318, 2, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus25", 
      "inputs": [[312, 2, 0], [324, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "gru_40_t5__h_act", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[325, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul16", 
      "inputs": [[321, 0, 0], [326, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul17", 
      "inputs": [[320, 0, 0], [316, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "gru_40_t5_out", 
      "inputs": [[327, 0, 0], [328, 0, 0]]
    }, 
    {
      "op": "broadcast_mul", 
      "name": "broadcast_mul25", 
      "inputs": [[329, 0, 0], [308, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus26", 
      "inputs": [[310, 0, 0], [330, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape34", 
      "attrs": {"shape": "(0, 1, 108)"}, 
      "inputs": [[331, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "concat29", 
      "attrs": {
        "dim": "1", 
        "num_args": "2"
      }, 
      "inputs": [[302, 0, 0], [332, 0, 0]]
    }, 
    {
      "op": "slice_axis", 
      "name": "slice_axis35", 
      "attrs": {
        "axis": "1", 
        "begin": "6", 
        "end": "7"
      }, 
      "inputs": [[153, 0, 0]]
    }, 
    {
      "op": "_equal_scalar", 
      "name": "_equal_scalar6", 
      "attrs": {"scalar": "0"}, 
      "inputs": [[334, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape35", 
      "attrs": {"shape": "(0, 108)"}, 
      "inputs": [[335, 0, 0]]
    }, 
    {
      "op": "sum", 
      "name": "sum8", 
      "attrs": {
        "axis": "1", 
        "keepdims": "True"
      }, 
      "inputs": [[336, 0, 0]]
    }, 
    {
      "op": "_not_equal_scalar", 
      "name": "_not_equal_scalar6", 
      "attrs": {"scalar": "108"}, 
      "inputs": [[337, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape36", 
      "attrs": {"shape": "(0, 1)"}, 
      "inputs": [[338, 0, 0]]
    }, 
    {
      "op": "_rminus_scalar", 
      "name": "_rminusscalar17", 
      "attrs": {"scalar": "1"}, 
      "inputs": [[339, 0, 0]]
    }, 
    {
      "op": "broadcast_mul", 
      "name": "broadcast_mul28", 
      "inputs": [[331, 0, 0], [340, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_40_t6__i2h", 
      "attrs": {"num_hidden": "324"}, 
